Repository: lzcabrera/www.html5rocks.com
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: es

source: Themes
es: Temas

source: Technologies
es: Tecnologías

source: Techniques
es: Técnicas

source: Further Reading
es: Material de lectura adicional

source: HTML5 Logo
es: Logotipo de HTML5

source: Terms
es: Términos

source: Privacy
es: Privacidad

source: Report bug or request a feature
es: Notificar un error o solicitar una función

source: Follow us on Twitter
es: Síguenos en Twitter

source: About Authors
es: Acerca de los autores

source: Made by Google
es: Diseñado por Google

source: This site contains information on APIs that are not part of the W3C HTML5 specification.
es: Este sitio contiene información sobre las API que no son parte de la especificación W3C de HTML5.

source: A new version of this site is available. Load it?
es: Hay disponible una nueva versión de este sitio. ¿Quieres cargarla?

source: Published
es: Publicado

source: Updated
es: Actualización

source: HTML5 Powered
es: Con la tecnología de HTML5

source: Supported browsers:
es: Navegadores compatibles:

source: supported
es: compatible

source: unsupported
es: no se admite

source: Your browser may not support all of the functionality in this article.
es: Es posible que tu navegador no admita todas las funciones utilizadas en este artículo.

source: Your browser appears to support all of the functionality in this article.
es: Parece que tu navegador admite todas las funciones utilizadas en este artículo.

source: Leave a comment
es: Dejar un comentario

source: Table of Contents
es: Índice

source: Localizations
es: Traducciones

source: This article is additionally available in the following languages:
es: Este artículo también está disponible en los siguientes idiomas:
