Repository: lzcabrera/www.html5rocks.com
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: es

source: Techniques for Streaming Multimedia
es: Técnicas para la emisión de contenido multimedia

source: Techniques for streaming content using various HTML5 APIs.
es: Técnicas para la emisión de contenido con diversas API HTML5

source: Gradient Studios ported their award-winning Fieldrunners game to HTML5. This article chronicles their journey in utilizing the Web Audio API to implement sound for Fieldrunners.
es: Gradient Studios transformo el juego Fieldrunners que ha ganado premios. Este artículo narra la trayectoria de utilizar la Web Audio API para implementar el sonido para Fieldrunners.

source: WebGL Transforms
es: Transformaciones con WebGL

source: How 3D transforms work and how you can use them in WebGL.
es: Cómo funcionan las transformaciones 3D y cómo se pueden utilizar en WebGL

source: Creating a Mobile-First Responsive Web Design
es: Creando un Diseño Web Sensible usando Tecnología-Móbil-Primero

source: Writing Augmented Reality Applications using JSARToolKit
es: Desarrollo de aplicaciones de realidad aumentada con JSARToolKit

source: Using the JSARToolKit library with WebRTC to build augmented reality applications in JavaScript.
es: Uso de la biblioteca JSARToolKit con WebRTC para crear aplicaciones de realidad aumentada en JavaScript

source: Developing Game Audio with the Web Audio API
es: Desarrollo del audio de los juegos con el API de Web Audio

source: Varied intensity background music, overlapping sound effects and randomization, sound source and listener spatialization (and directional sound cones), room effects via convolution, detect and prevent clipping, and implement dynamics compression. Including interactive inline demos!
es: Música de fondo de intensidad variada, reproducción aleatoria y efectos de superposición de sonidos, espacialización de oyente y fuente sonora (y conos de sonido direccional), efectos de estancia mediante convolución, detección y prevención de distorsiones de recorte e implementación de comprensión de rangos dinámicos. ¡Se incluyen demos integradas interactivas!

source: Case Study: Building Technitone.com
es: Caso práctico: creación de Technitone.com

source: How Technitone.com was built with the Web Audio API, WebGL, WebSockets, and a decent amount of magic.
es: Cómo se creó Technitone.com con el API de Web Audio, WebGL, WebSockets y unos cuantos toques mágicos

source: Capturing Audio &amp; Video in HTML5
es: Captura de audio y vídeo en HTML5

source: How to capture audio and video using the navigator.getUserMedia() API.
es: Captura de audio y vídeo con el API navigator.getUserMedia()

source: Case Study: Bouncy Mouse
es: Caso práctico: Bouncy Mouse

source: Bouncy Mouse is a slingshot platformer by Munkadoo Games. This article talks about porting the game to HTML5 and WebAudio.
es: Bouncy Mouse es un juego de plataforma de tirachinas de Munkadoo Games. Este artículo trata sobre el traslado de este juego a HTML5 y WebAudio.

source: Mixing Positional Audio and WebGL
es: Combinación del audio posicional y WebGL

source: How to use the positional audio features in Web Audio API with Three.js.
es: Uso de las funciones de audio posicional en el API de Web Audio con Three.js

source: WebGL Fundamentals
es: Aspectos básicos de WebGL

source: Fundamentals of using WebGL as a 2D drawing API and using shaders for image processing.
es: Aspectos básicos del uso de WebGL como API de dibujo en 2D y del uso de sombreadores para el procesamiento de imágenes

source: Getting Started With the Track Element
es: Introducción al elemento de pista

source: The track element provides a simple, standardized way to add subtitles and captions to video and audio, but can also be used with other kinds of timed data, to improve searchability and enable deep linking.
es: El elemento de pista proporciona un sistema sencillo y estandarizado de inclusión de subtítulos en audio y vídeo. Este elemento, que se puede utilizar también con otros tipos de datos sincronizados, facilita las búsquedas y permite crear enlaces profundos.

source: Google Photography Prize Gallery
es: Galería de Google Photography Prize

source: Building the gallery widget for the Google Photography Prize site using Closure.
es: Creación del widget de la galería del sitio de Google Photography Prize con Closure

source: Animating a Million Letters Using Three.js
es: Animación de un millón de letras con Three.js

source: A guide to using shaders to animate large amounts of particles.
es: Guía sobre el uso de sombreadores para la animación de grandes cantidades de partículas

source: Case Study: Building the Stanis&#x0142;aw Lem Google doodle
es: Caso práctico: creación del doodle Stanis&#x0142;aw Lem de Google

source: A walk through of the HTML5 tech behind the Stanis&#x0142;aw Lem Google doodle.
es: Exploración de la tecnología HTML5 utilizada en el doodle de Stanis&#x0142;aw Lem de Google

source: Migrating your WebSQL DB to IndexedDB
es: Migración de aplicaciones de WebSQL a IndexedDB

source: A look at what it would take to port a WebSQL based application to IndexedDB.
es: Pasos necesarios para trasladar una aplicación de WebSQL a IndexedDB

source: Using CORS
es: Uso de CORS

source: An introduction to Cross Origin Resource Sharing (CORS), which gives scripts the ability to make cross-origin XHRs.
es: Introducción a la tecnología Cross Origin Resource Sharing (CORS), que permite que las secuencias de comandos hagan solicitudes XHR cruzadas

source: The Synchronous FileSystem API for Workers
es: API síncrona de FileSystem para Web Workers

source: The HTML5 FileSystem API offers an synchronous version to be used in the context of Web Workers. The tutorial introduces the Synchronous API, and gives practical examples of using it.
es: El API de FileSystem de HTML5 ofrece una versión síncrona para Web Workers. En este tutorial se presenta el API síncrona y se muestran ejemplos prácticos de su uso.

source: Getting Started with Web Audio API
es: Introducción al API de Web Audio

source: A gentle introduction to loading and playing, cross-fading, and filtering sound using the Web Audio API.
es: Pequeña introducción a la carga, la reproducción, la fusión cruzada y el filtrado de sonido con el API de Web Audio

source: HTML5 Techniques for Optimizing Mobile Performance
es: Técnicas HTML5 para la optimización del rendimiento en dispositivos móviles

source: Learn the fundamentals of an HTML5 mobile framework. From network detection to sliding, flipping, and more.
es: Aspectos básicos del marco HTML5 para móviles (detección de red, deslizamiento, paso de página y otras muchas cosas)

source: Introduction to Rapha&euml;l.js
es: Introducción a Rapha&euml;l.js

source: Learn how to use Rapha&euml;l.js to create cross-platform SVG scenes.
es: Uso de Rapha&euml;l.js para la creación de escenas SVG para varias plataformas

source: Measuring Page Load Speed with Navigation Timing
es: Cálculo de la velocidad de carga de página con Navigation Timing

source: Get accurate and detailed timing statistics-natively-for page navigation and load events.
es: Obtención de estadísticas de tiempo detalladas y exactas de forma nativa correspondientes a eventos de carga y exploración de páginas

source: Improving HTML5 Canvas Performance
es: Mejora del rendimiento del elemento canvas de HTML5

source: Ten tips to make your canvas applications and games faster. Every technique is backed up by a performance test.
es: Diez sugerencias para mejorar la velocidad de juegos y aplicaciones que utilizan el elemento canvas (con pruebas de rendimiento de cada técnica)

source: How Browsers Work: Behind the scenes of modern web browsers
es: Cómo funcionan los navegadores: lo que hay detrás de los navegadores web actuales

source: In this comprehensive primer, you will learn what happens in the browser between when you type google.com in the address bar until you see the Google page on the browser screen.
es: Completo manual en el que se explica lo que sucede en un navegador desde el momento en que se escribe google.com en la barra de direcciones hasta que aparece la página de Google en la pantalla del navegador

source: Integrating Canvas into your Web App
es: Integración del elemento canvas en una aplicación web

source: Use the HTML5 canvas element to create, edit, open, export images and tips on how these techniques can be applied to an existing web application.
es: Uso del elemento canvas de HTML5 para crear, editar, abrir y exportar imágenes y sugerencias para la aplicación de estas técnicas a aplicaciones web ya creadas

source: Case Study: Auto-Resizing HTML5 Games
es: Caso práctico: ajuste automático del tamaño de juegos creados con HTML5

source: Resizing your game to fit a variety of form factors and window sizes.
es: Ajuste del tamaño de un juego para adaptarlo a diversos formatos y tamaños de ventana

source: Simple Asset Management for HTML5 Games
es: Sencilla administración de elementos de juegos creados con HTML5

source: Centralize and manage the asset downloads for your HTML5 game.
es: Centralización y administración de las descargas de elementos de los juegos creados con HTML5

source: Feature, Browser, and Form Factor Detection: It's Good for the Environment
es: Detección de función, navegador y formato: adecuación al entorno

source: Tune your app to the environment it's running in using Feature Detection, Browser Detection, and Form Factor detection.
es: Adaptación de una aplicación al entorno en el que se utiliza mediante la detección de función, la detección de navegador y la detección de formato

source: HTML5 vs Native: The Mobile App Debate
es: Aplicaciones HTML5 o nativas: el debate de las aplicaciones para móviles

source: There are still compelling reasons to go native, and clearly, many developers are indeed going that route. This article is a debate on native versus web. We'll examine each point in favor of native, then we'll let the web come in and give its best defense.
es: Existen todavía importantes razones que justifican el uso de aplicaciones nativas y, sin duda, muchos desarrolladores siguen eligiendo esta opción. En este artículo se presenta un debate entre aplicaciones nativas y aplicaciones web en el que se exponen diferentes argumentos a favor del uso de aplicaciones nativas, que se intentan rebatir con otros argumentos en defensa de las aplicaciones web.

source: An Introduction to Shaders
es: Introducción a los sombreadores

source: Want to learn about WebGL shaders but don't know where to start? I'm here to help!
es: ¿Quieres informarte sobre los sombreadores de WebGL pero no sabes por dónde empezar? ¡Deja que te ayude!

source: Getting Started with Three.js
es: Introducción a Three.js

source: Three.js is a powerful engine for doing native 3D work in your browser. But how do you get going?
es: En este artículo se explica cómo se puede utilizar Three.js, un potente motor que permite crear contenido 3D nativo en el navegador.

source: Making Forms Fabulous with HTML5
es: Creación de formas fabulosas con HTML5

source: Take advantage of improved forms support in HTML5 to build better forms, more easily.
es: Aprovecha la posibilidad que ofrece HTML5 de crear formas mejores más fácilmente.

source: Working Off the Grid with HTML5 Offline
es: Trabajo sin conexión a la red con HTML5

source: This article covers practical techniques and examples for handling connectivity flakiness.
es: En este artículo se explican algunos métodos prácticos que pueden servir para hacer frente a las incidencias relacionadas con la conectividad.

source: Rendering HTML5 in older browsers with Google Chrome Frame
es: Representación de contenido HTML5 en navegadores antiguos con Google Chrome Frame

source: HTML5 adds a multitude of new awesome tools to the web developer toolbox. Google Chrome Frame helps bringing these features to older browsers. This article will tell you how to use Chrome Frame on your site.
es: HTML5 ofrece a los desarrolladores web una infinidad de nuevas y fabulosas herramientas. En este artículo se explica cómo se puede utilizar en un sitio web el complemento Google Chrome Frame, que permite incorporar estas funciones en navegadores antiguos.

source: New Tricks in XMLHttpRequest2
es: Nuevos trucos para XMLHttpRequest2

source: There has been a slew of improvements to our old friend <code>XMLHttpRequest</code> for working with different types of data. This tutorial covers the new hotness.
es: Se han introducido una gran cantidad de mejoras en la vieja especificación <code>XMLHttpRequest</code> para poder trabajar con distintos tipos de datos. En este tutorial se explican estas novedades.

source: Chrome Experiments Demo Harness
es: Demostraciones de Chrome Experiments

source: Experiences from building a kiosk-style demo station with HTML and WebGL.
es: Experiencias a raíz de la construcción de un stand de demostraciones a modo de quiosco con HTML y WebGL

source: Image Filters with Canvas
es: Filtros de imágenes con canvas

source: A quick guide to writing custom image filters with &lt;canvas&gt;.
es: Guía rápida para la creación de filtros de imágenes personalizados con &lt;canvas&gt;

source: This End Up: Using Device Orientation
es: Determinación de la posición: uso de la orientación del dispositivo

source: Learn how to use device orientation and device motion events to tell when your computer is moving.
es: Aprende a utilizar los eventos de movimiento y orientación de dispositivos para saber cuándo se está moviendo tu ordenador.

source: Multi-touch Web Development
es: Desarrollo web con tecnología Multitouch

source: Introduction on touch events for mobile devices.
es: Introducción a los eventos de toques para dispositivos móviles

source: Case Study: Real-time Updates in Stream Congress
es: Caso práctico: actualizaciones en tiempo real en Stream Congress

source: Choosing the right technology to accomplish real-time, asynchronous updates.
es: Elección de la tecnología adecuada para realizar actualizaciones asíncronas en tiempo real

source: Case Study: Converting Wordico from Flash to HTML5
es: Caso práctico: conversión de Wordico de Flash a HTML5

source: Learn how we converted our <a href="https://chrome.google.com/webstore/detail/ehehfnkgbccpcjmfhdkbeakkpibbcfdl">Wordico</a> crossword game from Flash to HTML5.
es: Descubre cómo hemos convertido nuestro juego de palabras cruzadas <a href="https://chrome.google.com/webstore/detail/ehehfnkgbccpcjmfhdkbeakkpibbcfdl">Wordico</a> de Flash a HTML5.

source: "Mobifying" Your HTML5 Site
es: "Movilización" de un sitio HTML5

source: A guide on how to create a mobile version of an existing HTML5 website. This study looks at what was required to make html5rocks.com friendly to mobile users.
es: Guía sobre cómo crear una versión para móviles de un sitio web HTML5 que se centra en los requisitos necesarios para hacer que el sitio html5rocks.com se pueda utilizar en dispositivos móviles

source: Typographic effects in canvas
es: Efectos tipográficos en canvas

source: Effects in canvas inner/outer shadows, neon-glows, reflections, space-age, pattern/gradient overlays, stereoscopic imaging, and other text/vector-effects...
es: Efectos en imágenes estereoscópicas, superposiciones de gradientes/patrones, espaciado, reflejos, brillos de neón, sombras internas o externas y otros efectos de vectores/texto...

source: Improving the Performance of your HTML5 App
es: Cómo mejorar el rendimiento de tu aplicación HTML5

source: Optimization strategies and techniques for HTML5 applications.
es: Técnicas y estrategias de optimización para aplicaciones HTML5

source: Case Study: Onslaught! Arena
es: Caso práctico: Onslaught! Arena

source: Learn how <a href="https://chrome.google.com/webstore/detail/khodnfbkbanejphecblcofbghjdgfaih">Onslaught! Arena</a> created their fast-paced, arcade-style medieval fantasy shoot 'em up.
es: Descubre cómo creó <a href="https://chrome.google.com/webstore/detail/khodnfbkbanejphecblcofbghjdgfaih">Onslaught! Arena</a> su juego de fantasía medieval de disparos a toda velocidad.

source: No Tears Guide to HTML5 Games
es: Guía fácil de juegos en HTML5

source: Building an HTML5 game using &lt;canvas&gt;, the no tears way.
es: Creación de un juego en HTML5 con &lt;canvas&gt; de una forma sencilla

source: Case Study: HTML5 MathBoard
es: Caso práctico: HTML5 MathBoard

source: A discussion on how the iPad's popular <a href="https://chrome.google.com/webstore/detail/elcilkmmbpmchojdmdohhoalmfmkcklk">MathBoard</a> application was ported to HTML5.
es: Debate sobre cómo se ha trasladado a HTML5 la popular aplicación href="https://chrome.google.com/webstore/detail/elcilkmmbpmchojdmdohhoalmfmkcklk">MathBoard</a> de iPad

source: Case Study: Page Flip Effect from 20thingsilearned.com
es: Caso práctico: el efecto de pasar la página en el sitio 20thingsilearned.com

source: Learn how to re-create the page flip effect found on <a href="http://www.20thingsilearned.com">20thingsilearned.com</a> using the Canvas API.
es: Aprende a volver a crear el efecto de pasar la página del sitio <a href="http://www.20thingsilearned.com">20thingsilearned.com</a> utilizando el API de canvas.

source: Exploring the FileSystem APIs
es: Cómo explorar las API de sistemas de archivos (FileSystem APIs)

source: The FileSystem APIs give applications the ability to read/write files and directories in a secure, sandboxed file system on a user's local machine.
es: Las API de sistemas de archivos (FileSystem APIs) permiten que las aplicaciones realicen operaciones de lectura y escritura de archivos y directorios en un sistema de archivos seguro y protegido en el equipo local de un usuario.

source: A Simple TODO list using HTML5 IndexedDB
es: Una sencilla lista de tareas pendientes utilizando IndexedDB de HTML5

source: IndexedDB represents the future of query-able client-side storage. This tutorial presents a real world application implementing the basics of the IndexedDB API.
es: IndexedDB representa el futuro del almacenamiento en clientes con posibilidad de consulta. En este tutorial se presenta una aplicación real que incorpora los aspectos básicos del API de IndexedDB.

source: Case Study: Getting Entangled with HTML5 Canvas
es: Caso práctico: introducción a canvas en HTML5

source: Entanglement is a puzzle game made by Gopherwood Studios. This article talks about Entanglement's usage of the &lt;canvas&gt; tag.
es: "Entanglement" es un juego de ingenio creado por Gopherwood Studios. En este artículo se explica cómo se utiliza la etiqueta &lt;canvas&gt; en este juego.

source: Stream Updates with Server-Sent Events
es: Actualizaciones de flujo con eventos enviados por el servidor

source: The EventSource API is designed for receiving push notifications from a server, removing the need for client-size XHR polling.
es: El API de origen de eventos (EventSource API) está diseñada para recibir notificaciones de inserción desde un servidor, lo que evita las solicitudes XHR de clientes.

source: Introducing WebSockets: Bringing Sockets to the Web
es: Introducción a los WebSockets: incorporación de sockets a la Web

source: Learn how to use WebSockets to add low latency bidirectional client-server communication to your web app.
es: Descubre cómo usar WebSockets para añadir una comunicación bidireccional cliente-servidor de baja latencia a tu aplicación web.

source: Quick hits with the Flexible Box Model
es: Resultados rápidos con Flexible Box Model

source: An introduction to <q>flexbox</q>, an alternative <abbr title="Cascading Style Sheets">CSS</abbr> layout scheme based on vboxes and hboxes.
es: Introducción a <q>flexbox</q>, un esquema de diseño <abbr title="Cascading Style Sheets">CSS</abbr> alternativo basado en vboxes y hboxes

source: Client-Side Storage
es: Almacenamiento del cliente

source: An overview of client-side storage techniques: Web Storage (local/session storage), Web SQL Database, Indexed Database, Filesystem.
es: Descripción general de las técnicas de almacenamiento del cliente: Web Storage (almacenamiento local o de sesión), Web SQL Database, Indexed Database y FileSystem

source: Native HTML5 Drag and Drop
es: Arrastrar y soltar en HTML5 nativo

source: Drag-and-drop is yet another first class citizen in HTML5! This article explains how to enhance your web applications by adding native DnD functionality.
es: La función de arrastrar y soltar es otro de los elementos destacados de HTML5. En este artículo se explica cómo mejorar tus aplicaciones web añadiendo esta función nativa.

source: Case Study: HTML5 in deviantART muro
es: Caso práctico: HTML5 en deviantART muro

source: Learn how deviantART used HTML5 drawing features in deviantART muro.
es: Descubre cómo ha utilizado deviantART las funciones de dibujo de HTML5 en deviantART muro.

source: Case Study: Drag and Drop Download in Chrome
es: Caso práctico: descarga de archivos con arrastrar y soltar en Chrome

source: Learn how Box.net implemented GMail's attachment drag and drop to the desktop.
es: Descubre cómo implementó Box.net la función de arrastrar un archivo adjunto de Gmail y soltarlo en el escritorio.

source: 3D and CSS
es: 3D y CSS

source: Learn how to build exciting 3D user interfaces using the power of CSS.
es: Descubre cómo crear fabulosas interfaces de usuario 3D con todo el potencial de CSS.

source: HTML5 Video
es: Vídeo HTML5

source: Video is one of the most interesting and widely supported features of HTML5. This tutorial covers the mechanics of incorporating native video into your site (without a plugin) and gives interesting examples of using the &gt;video&lt; tag.
es: El vídeo es una de las funciones más interesantes y compatibles de HTML5. En este tutorial se describen los mecanismos de incorporación de vídeos nativos a un sitio (sin utilizar un complemento) y se muestran algunos interesantes ejemplos del uso de la etiqueta &gt;video&lt;.

source: "Offline": What does it mean and why should I care?
es: Sin conexión: ¿qué significa y por qué debería importarme?

source: A discussion of what it means to take an application "offline" and the options available to developers for doing so.
es: Debate sobre lo que significa hacer que una aplicación se pueda utilizar "offline" (sin conexión) y sobre las opciones disponibles para que los desarrolladores lleven a cabo esta tarea

source: Quick guide to webfonts via @font-face
es: Guía rápida de las fuentes web a través de @font-face

source: Webfonts give new typographic freedom to designers while retaining scalability and accessibility.
es: Las fuentes web (Webfonts) proporcionan una nueva libertad tipográfica a los diseñadores a la vez que mantienen la escalabilidad y la accesibilidad.

source: Auditing Your Web App For Speed
es: Cómo hacer un análisis de la velocidad de tu aplicación web

source: The Audit Panel is an excellent tool for examining latency in your web apps. It offers customized recommendations to enhance performance and reduce latency.
es: El panel "Audit" es una excelente herramienta que permite examinar la latencia de las aplicaciones web y que ofrece recomendaciones personalizadas para mejorar el rendimiento y reducir la latencia.

source: The Basics of Web Workers
es: Introducción a los Web Workers

source: Web Workers are a means of spawning background scripts in your application, giving thread-like message passing for handling computationally intensive tasks.
es: Los Web Workers permiten enviar secuencias de comandos en segundo plano en una aplicación, lo que hace posible la transferencia de mensajes de cadena para la gestión de tareas intensivas de computación.

source: Introduction to Chrome Developer Tools, Part One
es: Introducción a las Herramientas para desarrolladores de Chrome: primera parte
