Repository: lzcabrera/www.html5rocks.com
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: es

source: An introduction to the tools available in Google Chrome that make a developer's life easier!
es: Introducción a las herramientas disponibles en Google Chrome que facilitan el trabajo de los desarrolladores

source: Best Practices for a Faster Web App with HTML5
es: Prácticas recomendadas para una aplicación web más rápida con HTML5

source: How to effectively use features from HTML5 to improve the performance and responsiveness of your app.
es: Cómo utilizar eficazmente las funciones de HTML5 para mejorar el rendimiento y la capacidad de respuesta de tu aplicación

source: A Beginner's Guide to Using the Application Cache
es: Guía para principiantes sobre el uso de la caché de aplicaciones

source: A step-by-step guide to taking your web app offline using the application cache APIs.
es: Guía paso a paso en la que se explica cómo se puede hacer que una aplicación web se pueda utilizar sin conexión con las API de caché de aplicaciones

source: Practical Guide to Take Your TODO List Offline
es: Guía práctica para ver tu lista de tareas pendientes sin conexión

source: Expanding on the <a href="/%(LANGUAGE_CODE)s/tutorials/webdatabase/todo/">simple TODO list</a>, this tutorial gives a practical guide for taking the sample offline using the application cache.
es: Este tutorial, en el que se amplía la <a href="/%(LANGUAGE_CODE)s/tutorials/webdatabase/todo/">lista sencilla de tareas pendientes</a>, muestra un ejemplo práctico de lo que se debe hacer para que una aplicación se pueda utilizar sin conexión mediante la caché de aplicaciones.

source: Reading files in JavaScript using the File APIs
es: Cómo leer archivos en JavaScript a través de las API de archivos

source: Starter guide for using the File/FileList/FileReader APIs to process and read binary files in JavaScript.
es: Guía de introducción para utilizar las API de archivos File, FileList y FileReader para procesar y leer archivos binarios en JavaScript

source: A Simple Trip Meter using the Geolocation API
es: Un contador de viajes sencillo a través del API de ubicación geográfica

source: Learn how to implement geolocation very quickly including a distance calculator
es: Aprende a implementar rápidamente la función de determinación de la ubicación geográfica incluyendo una calculadora de distancia.

source: Using the Notifications API
es: Cómo utilizar el API de notificaciones

source: Learn the notification basics creating a twitter notification
es: Descubre los aspectos básicos de las notificaciones mediante la creación de una notificación de Twitter.

source: A Simple TODO list using HTML5 WebDatabases
es: Una sencilla lista de tareas pendientes con WebDatabases de HTML5

source: Create a TODO list which persists data using a client side database.
es: Crea una lista de tareas para conservar datos utilizando una base de datos de cliente.

source: Quick Guide to Implementing the HTML5 Audio Tag
es: Guía rápida de implementación de la etiqueta de audio de HTML5

source: Learn how to use the HTML5 audio tag and fall back to Flash on platforms which do not support it.
es: Aprende a usar la etiqueta de audio HTML5 y olvídate de las incidencias con Flash en las plataformas que no son compatibles con Flash.

source: this feature
es: esta función

source: HTML5Rocks - Posts & Tutorials
es: HTML5Rocks - Publicaciones y tutoriales

source: A resource for developers looking to put HTML5 to use today, including information on specific features and when to use them in your apps.
es: Un recurso para los desarrolladores que quieran utilizar HTML5 hoy mismo, incluida información sobre funciones específicas y sobre cuándo utilizarlas en tus aplicaciones

source: Sorry, this article isn't available in your native language; we've redirected you to the English version.
es: Este artículo no está disponible en tu idioma, por lo que te hemos redirigido a la versión en inglés.

source: Home
es: Página de inicio

source: Community
es: Comunidad

source: The HTML5 community is getting bigger and bigger. Here you will find some resources to be up to date about the latest HTML5 news as well as to be able to discuss with developers and engineers the experimental features and proposals around the standards and browser implementations.
es: La comunidad HTML5 es cada vez mayor. En esta sección podrás encontrar algunos recursos para mantenerte actualizado sobre las últimas noticias relacionadas con HTML5, así como debatir con desarrolladores e ingenieros sobre las propuestas y funciones experimentales relacionadas con los estándares e implementaciones del navegador.

source: Forum
es: Foro

source: Events
es: Eventos

source: IRC Channel
es: Canal IRC

source: HTML5 conferences (Lanyrd)
es: Conferencias sobre HTML5 (Lanyrd)

source: HTML5 Meetup Groups
es: Grupos Meetup sobre HTML5

source: Google Developer Events Calendar
es: Calendario de eventos para desarrolladores de Google

source: HTML5 Events
es: Eventos de HTML5

source: A resource for open web HTML5 developers
es: Un recurso para desarrolladores de HTML5 para una Web abierta

source: Latest Articles
es: Últimos artículos

source: Tweet
es: Tuitear

source: See more &rarr;
es: Ver más &rarr;

source: Welcome to HTML5ROCKS
es: Te damos la bienvenida a HTML5ROCKS

source: What kind of HTML dev do you think you are?
es: ¿Qué tipo de desarrollador de HTML te consideras?

source: HTML5 is the ubiquitous platform for the web. Whether you're a mobile web developer, an enterprise with specific business needs, or a serious game dev looking to explore the web as a new platform, HTML5 has something for you! Choose your path:
es: HTML5 es la plataforma ideal para la Web. Tanto si eres un desarrollador de contenido web para móviles como una empresa con unas determinadas necesidades comerciales o un desarrollador de juegos profesional que quiere explorar las posibilidades de la Web como nueva plataforma, HTML5 tiene algo para ti. Elige tu camino:

source: Mobile
es: Móvil

source: Web developers can use the same set of technologies they know and love to build rich web applications that work across different device types.
es: Los desarrolladores web pueden utilizar el mismo conjunto de tecnologías que ya conocen y que les gustan para crear completas aplicaciones web que funcionen en diferentes tipos de dispositivos.

source: Gaming
es: Juegos

source: High performance 2D/3D graphics, offline asset storage, rich audio APIs, and socket-based networking let you create compelling modern games and reach users like never before.
es: Los gráficos 2D/3D de alto rendimiento, el almacenamiento de recursos sin conexión, las completas API de audio y las conexiones de red mediante sockets permiten crear juegos modernos muy atractivos que abren nuevas posibilidades a los jugadores.

source: Business
es: Empresas

source: HTML5 brings substantial benefits for companies that no other IT model can &ndash; in simplicity, cost, security, flexibility and mobility.
es: HTML5 ofrece a las empresas unos beneficios que no puede ofrecer ningún otro modelo de TI en cuanto a simplicidad, costes, seguridad, flexibilidad y movilidad.

source: Or get straight to the tech!
es: O pasa directamente a los aspectos técnicos

source: HTML5 Features
es: Funciones de HTML5

source: HTML5 is making the web platform more powerful in a number of different areas. Try learning by major HTML5 feature groups.
es: HTML5 está potenciando las posibilidades de la Web en distintos aspectos. Te recomendamos que aprendas los principales grupos de funciones de HTML5.

source: Offline
es: Sin conexión

source: Storage
es: Almacenamiento

source: Connectivity
es: Conectividad

source: Semantics
es: Semántica

source: Audio/Video
es: Audio/Vídeo

source: 3D/Graphics
es: 3D/Gráficos

source: Presentation
es: Presentación

source: Performance
es: Rendimiento

source: Nuts &amp; Bolts
es: Elementos básicos

source: Why HTML5?
es: ¿Por qué se debe utilizar HTML5?

source: Why you should care.
es: ¿Por qué debería importarte?

source: HTML5 introduces many cutting-edge features that enable developers to create web apps&hellip;
es: HTML5 incluye muchas funciones nuevas que ayudan a los desarrolladores a crear aplicaciones web&hellip;

source: Updates
es: Actualizaciones

source: Learn what's new.
es: Conoce las novedades.

source: Articles, tutorials, case studies, and demos that show you how to use HTML5 features.
es: Artículos, tutoriales, casos prácticos y demostraciones que muestran cómo utilizar las funciones de HTML5

source: Resources
es: Recursos

source: All HTML5, all the time.
es: HTML5. Siempre contigo.

source: Cultivated list of additional resources to help you on your HTML5 learning voyage.
es: Lista elaborada de recursos adicionales que pueden ayudarte en tu experiencia de aprendizaje de HTML5

source: Contributors
es: Colaboradores

source: HTML5 Gurus Rock
es: Expertos de HTML5

source: HTML5Rocks is <a href="http://code.google.com/p/html5rocks/" rel="external">open source</a> and community driven. Tweak the code or <a href="http://code.google.com/p/html5rocks/wiki/ContributorsGuide" rel="external">contribute</a> a new tutorial. We'd love to have your help and expertise!
es: HTML5Rocks es un proyecto de <a href="http://code.google.com/p/html5rocks/" rel="external">software libre</a> mantenido por la comunidad. Mejora el código o <a href="http://code.google.com/p/html5rocks/wiki/ContributorsGuide"rel="external">colabora</a> con un nuevo tutorial. ¡Nos encantará contar con tu ayuda y tus conocimientos!

source: <strong>Follow us</strong> on <span>Google+</span>
es: <strong>Síguenos</strong> en <span>Google+</span>

source: Privacy Policy
es: Política de privacidad

source: HTML5 Rocks <span>Privacy Policy</span>
es: <span>Política de privacidad</span> de HTML5 Rocks

source: The HTML5ROCKS website (the "Website") is hosted by Google and, as such, for the purposes of personal information, the Website operates as any other Google service. Google's Privacy Policy is available at <a href="http://www.google.com/privacy.html">http://www.google.com/privacy.html</a>.</p>
es: El sitio web de HTML5ROCKS (el "Sitio web") se aloja en Google y, como tal, su funcionamiento en lo referente a la información personal es el mismo que el de cualquier otro servicio de Google. La Política de privacidad de Google está disponible en la página <a href="http://www.google.com/privacy.html">http://www.google.com/privacy.html</a>.</p>

source: Author Profiles
es: Perfiles de autor

source: Authors
es: Autores

source: Our honorable contributors.
es: Nuestros honorables colaboradores

source: You can <a href="http://twitter.com/ChromiumDev">follow us on Twitter</a>, read the <a href="/%(LANGUAGE_CODE)s/tos">Terms of Service</a> or <a href="/%(LANGUAGE_CODE)s/privacy">Privacy Policy</a>, or <a href="http://code.google.com/p/html5rocks/issues/entry">report a bug or request a feature</a>. <small>This site contains information on APIs that are not part of the W3C HTML5 specification.</small>
es: Puedes <a href="http://twitter.com/ChromiumDev">seguirnos en Twitter</a>, leer las <a href="/%(LANGUAGE_CODE)s/tos">Condiciones del servicio</a> y la <a href="/%(LANGUAGE_CODE)s/privacy">Política de privacidad</a> y <a href="http://code.google.com/p/html5rocks/issues/entry">notificar errores o solicitar funciones</a>. <small>Este sitio contiene información sobre API que no están incluidas en la especificación sobre HTLML5 del W3C.</small>

source: <strong>HTML5 Rocks</strong> is a <strong><img src="/static/images/google_logo_small.png" alt="Google logo" title="Google"></strong> project.
es: <strong>HTML5 Rocks</strong> es un proyecto de <strong><img src="/static/images/google_logo_small.png" alt="logotipo de Google" title="Google"></strong>.

source: Contributions
es: Aportaciones

source: <strong>HTML5 Rocks</strong> is a <strong><img src="/static/images/google_logo_small.png" alt="Google"></strong> project.
es: <strong>HTML5 Rocks</strong> es un proyecto de <strong><img src="/static/images/google_logo_small.png" alt="Google"></strong>.

source: Contribute
es: Contribuir

source: This site and all of its tutorials and presentation slides are <a href="http://code.google.com/p/html5rocks/" rel="external">open source projects</a>. Tweak the code or <a href="http://code.google.com/p/html5rocks/wiki/ContributorsGuide" rel="external">contribute</a> new guides!
es: Este sitio, sus tutoriales y sus diapositivas de presentación son <a href="http://code.google.com/p/html5rocks/" rel="external">proyectos de código abierto</a>. Utiliza el código o <a href="http://code.google.com/p/html5rocks/wiki/ContributorsGuide" rel="external">colabora</a> con nuevas guías.

source: Ready to develop in HTML5 but worried about supporting older versions of Internet Explorer? Learn how <a href="http://code.google.com/chrome/chromeframe/">Google Chrome Frame</a> can help. It's easy to include on your site:
es: ¿Estás listo para desarrollar en HTML5 pero te preocupa la compatibilidad con versiones anteriores de Internet Explorer? Descubre cómo puede ayudarte <a href="http://code.google.com/chrome/chromeframe/">Google Chrome Frame</a>, un complemento que puedes incluir fácilmente en tu sitio:

source: Reference
es: Referencia

source: Visual timeline of HTML5 feature support.
es: Cronología visual de la compatibilidad con las funciones de HTML5

source: Up to date HTML5 feature browser support reference.
es: Referencia actualizada sobre la compatibilidad con el navegador de las funciones de HTML5

source: Series of browser tests to evaluate feature support.
es: Una serie de pruebas del navegador para evaluar la compatibilidad con funciones

source: Follow the engineering effort for cutting edge support from the Chrome team.
es: Sigue los avances de ingeniería del equipo de Chrome para conseguir la compatibilidad más avanzada.

source: Opera's support for HTML5 standards
es: Compatibilidad de Opera con los estándares de HTML5

source: If the Wikipedia says it then it must be true.
es: Si la Wikipedia lo dice, entonces debe ser cierto.

source: Detailed table of ES5 support across browsers.
es: Tabla detallada de compatibilidad con ES5 en navegadores

source: Results of DOM and CSS properties tests in major browsers.
es: Resultados de las pruebas de propiedades DOM y CSS en los principales navegadores

source: html5demos.com is a demo site with cross-browser demos.
es: html5demos.com es un sitio que ofrece demostraciones para diferentes navegadores.

source: html5-demos.com is another demo site with cutting-edge demos and slide decks.
es: html5-demos.com es otro sitio que ofrece avanzados conjuntos de diapositivas y demostraciones.

source: A guide to help developers build great web applications.
es: Guía para ayudar a los desarrolladores a crear fantásticas aplicaciones web

source: Documentation
es: Documentación

source: WHATWG HTML5 Spec, only author info preserved. Perfect for web developers.
es: Especificación HTML5 de WHATWG: solo se conserva la información de autor. Perfecto para desarrolladores web

source: Learn HTML5 and have a laugh at the same time.
es: Aprende a utilizar HTML5 mientras te diviertes.

source: Excellent WebKit-oriented development documentation.
es: Excelente documentación de desarrollo orientada a WebKit

source: Excellent documentation and guides.
es: Excelentes guías y documentación

source: Working draft spec of everything under the larger HTML5 umbrella.
es: Especificación de borrador de todo lo que engloba el gran lenguaje HTML5

source: Tools
es: Herramientas

source: Javascript library for feature detection and control fallback cases of HTML5.
es: Biblioteca Javascript para detectar funciones y controlar casos alternativos de HTML5

source: Javascript patch to make IE support, and print, the new tag elements.
es: Parche de JavaScript para que Internet Explorer sea compatible e imprima los elementos de la nueva etiqueta

source: An set of HTML/CSS/JS templates with best practices for HTML5 and front-end dev built in.
es: Un conjunto de plantillas HTML, CSS y JavaScript que incorpora prácticas recomendadas para la integración del desarrollo de la interfaz y HTML5

source: The collection of scripts that enable HTML5 features in all browsers.
es: El conjunto de secuencias de comandos que habilita las funciones de HTML5 en todos los navegadores

source: Preview CSS buttons with a fancy interface to play with the parameters.
es: Obtén una vista previa de los botones CSS con una interfaz elegante para hacer pruebas con los parámetros.

source: Test and get the code of the fanciest CSS features.
es: Prueba y obtén el código de las funciones CSS más elegantes.

source: Generate CSS code for gradients on the fly.
es: Genera código CSS para gradientes de forma instantánea.

source: Use CSS3 without having to worry about xbrowser differences.
es: Utiliza CSS3 sin tener que preocuparte por las diferencias entre navegadores.

source: Test your fonts using drag and drop.
es: Prueba tus fuentes mediante la función de arrastrar y soltar.

source: Most complete tool to generate code for you font-face support.
es: La herramienta más completa para generar código para la compatibilidad con "font-face"

source: Complete list of tools related to web performance.
es: Lista completa de herramientas relacionadas con el rendimiento web

source: Books
es: Libros

source: Search Results
es: Resultados de búsqueda

source: Loading
es: Cargando

source: Videos and Presentations
es: Vídeos y presentaciones

source: Slides, Presen&shy;ta&shy;tions & Videos
es: Diapositivas, presentaciones y vídeos

source: Below you can get your hands on the most recent presentations by Google Chrome Developer Relations and friends. Video is shared if available and you can view them by person, topic or event.
es: A continuación puedes examinar las presentaciones más recientes de algunos amigos y del equipo de Relaciones con desarrolladores de Google Chrome. Los videos se comparten si están disponibles y se pueden ver por persona, por tema o por evento.

source: Filter the talks to your liking
es: Filtra las conversaciones a tu gusto

source: filter by topic, person, etc
es: filtrar por tema, persona, etc.

source: Only show talks more recent than:
es: Mostrar solo conversaciones más recientes que:

source: Loading...
es: Cargando...

source: Terms of Service
es: Condiciones del servicio

source: HTML5 Rocks <span>Terms of Service</span>
es: <span>Condiciones del servicio</span> de HTML5 Rocks

source: The HTML5ROCKS website (the "Website") is hosted by Google. By using and/or visiting the Website, you consent to be bound by these terms of service as well as Google's general <a href="http://www.google.com/accounts/TOS">Terms of Service</a> and Google's general <a href="http://www.google.com/privacy.html">Privacy Policy</a>.
es: El sitio web de HTML5ROCKS (el "Sitio web") se aloja en Google. Al utilizar o visitar el Sitio web, aceptas estas condiciones del servicio, así como las <a href="http://www.google.com/accounts/TOS">Condiciones de servicio</a> generales de Google y su <a href="http://www.google.com/privacy.html">Política de privacidad</a>.

source: Why HTML5 Rocks
es: Por qué HTML5 es la estrella ahora

source: Why HTML5 <span>Rocks</span>
es: Por qué HTML5 es <span>la estrella ahora</span>

source: HTML5 introduces many cutting-edge features that enable developers to create apps and websites with the functionality, speed, performance, and experience of desktop applications. But unlike desktop applications, apps built on the web platform can reach a much broader audience using a wider array of devices. HTML5 accelerates the pace of your innovation and enables you to seamlessly roll out your latest work to all your users simultaneously.
es: HTML5 presenta muchas funciones nuevas que permiten a los desarrolladores crear aplicaciones y sitios web con la funcionalidad, la velocidad, el rendimiento y la experiencia de las aplicaciones de escritorio. Pero, a diferencia de estas, las aplicaciones web pueden llegar a un público mucho más amplio integrado por usuarios de una gama más amplia de dispositivos. HTML5 acelera el ritmo de la innovación y te permite ofrecer tus últimas creaciones a todos tus usuarios de forma simultánea.

source: Give me everything
es: Ver toda la información

source: Tutorials
es: Tutoriales

source: Why move to HTML5 now than later?
es: ¿Por qué cambiar a HTML5 desde ya?

source: Tools &amp; Frameworks
es: Herramientas y frameworks

source: Additional Resources
es: Recursos adicionales

source: Recent Contributors
es: Colaboradores recientes

source: Foo
es: Ejemplo

source: More efficient connectivity means more real-time chats, faster games, and better communication. Web Sockets and Server-Sent Events are pushing (pun intended) data between client and server more efficiently than ever before.
es: Una conectividad más eficaz se traduce en chats en verdadero tiempo real, una mayor velocidad en los juegos y una comunicación mejor. Las conexiones web y los eventos enviados por servidores están permitiendo que la eficacia en la transmisión de datos entre clientes y servidores alcance unos niveles sin precedentes.

source: <a href="http://example.com/">Foo</a> bar baz.
es: <a href="http://example.com/">Ejemplo</a> tal y cual

source: HTML5 agency Bocoup's deep research into EventSource
es: Investigación exhaustiva sobre EventSource de la agencia de HTML5 Bocoup

source: a hosted API for adding scalable realtime WebSockets functionality to your apps
es: un API alojada que te permite añadir a tus aplicaciones funciones de conexión web ampliables en tiempo real

source: The power of the EventSource API across browsers
es: Las posibilidades del API de EventSource en los navegadores

source: Feature
es: Función

source: What&rsquo;s New
es: Novedades

source: loading&hellip;
es: cargando&hellip;

source: IE
es: Internet Explorer

source: iOS Safari
es: Safari para iOS

source: Data courtesy of <a href="http://caniuse.com/">caniuse.com</a> and <a href="http://dev.chromium.org/developers/web-platform-status">Chrome Platform Status</a>.
es: Datos cedidos por <a href="http://caniuse.com/">caniuse.com</a> y la página de <a href="http://dev.chromium.org/developers/web-platform-status">estado de la plataforma Chrome</a>

source: HTML5 provides very powerful APIs to interact with binary data and a user's local file system. The File APIs give web applications the ability to do things like read files [a]synchronously, create arbitrary Blobs, write files to a temporary location, recursively read a file directory, perform file drag and drop from the desktop to the browser, and upload binary data using <code>XMLHttpRequest2</code>.
es: HTML5 proporciona API muy potentes que permiten interactuar con datos binarios y con el sistema de archivos local del usuario. Las API de archivos permiten que las aplicaciones web realicen tareas como leer archivos de forma síncrona o asíncrona, crear objetos BLOB arbitrarios, escribir archivos en una ubicación temporal, leer un directorio de archivos de forma recurrente, arrastrar archivos del escritorio y soltarlos en el navegador y subir datos binarios con <code>XMLHttpRequest2</code>.
