Repository: lzcabrera/www.html5rocks.com
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: es

source: <a href="http://dev.w3.org/html5/webstorage/">Web Storage</a> simply provides a key-value mapping, e.g. <code>localStorage["name"] = username;</code>. Unfortunately, present implementations only support string-to-string mappings, so you need to serialise and de-serialise other data structures. You can do so using <code>JSON.stringify()</code> and <code>JSON.parse()</code>.
es: El <a href="http://dev.w3.org/html5/webstorage/">almacenamiento web</a> simplemente proporciona una asignación de clave-valor (por ejemplo, <code>localStorage["name"] = username;</code>). Por desgracia, las implementaciones actuales solo admiten asignaciones de cadena a cadena, así que hay que serializar y deserializar otras estructuras de datos. Este procedimiento se puede realizar con <code>JSON.stringify()</code> y <code>JSON.parse()</code>.

source: <a href="http://dev.w3.org/html5/webdatabase/">Web SQL Database</a> gives you all the power - and effort - of a structured SQL relational database.
es: <a href="http://dev.w3.org/html5/webdatabase/">Web SQL Database</a> te proporciona toda la potencia de una base de datos relacional SQL estructurada.

source: <a href="http://www.w3.org/TR/IndexedDB/">Indexed Database</a> is somewhere in between Web Storage and Web SQL Database. Like Web Storage, it's a straightforward key-value mapping, but it supports indexes like those of relational databases, so searching objects matching a particular field is fast; you don't have to manually iterate through every object in the store.
es: <a href="http://www.w3.org/TR/IndexedDB/">Indexed Database</a> se encuentra a medio camino entre Web Storage y Web SQL Database. Al igual que Web Storage, se trata de una sencilla asignación de valores y claves, pero admite índices similares a los de las bases de datos relacionales, por lo que la búsqueda de objetos que corresponden a un campo específico es rápida. Además, no es necesario repetir la acción de forma manual en todos los objetos almacenados.

source: <a href="http://www.w3.org/TR/FileAPI/">File Access</a> is an API for reading file content in JavaScript. Given a set of files the user has added to a "file" input element, you can read the content of the file or reference it as a URL, e.g. if the user has specified an image file, you can show the image. There are also proposals underway for file writing capabilities.
es: <a href="http://www.w3.org/TR/FileAPI/">File Access</a> (acceso a archivos) es un API que permite leer contenido de archivos en JavaScript. En función de un conjunto de archivos que el usuario ha añadido a un elemento de entrada "archivo", puedes leer el contenido del archivo o hacer referencia a él como una URL (por ejemplo, si el usuario ha especificado un archivo de imagen, puedes mostrar la imagen). También se están desarrollando algunas propuestas relacionadas con funciones de escritura de archivos.

source: For a detailed comparison of client-side storage techniques with code demos, see our <a href="/tutorials/offline/storage/">Client-Side Storage</a> article.
es: Para ver una comparación detallada de las técnicas de almacenamiento del cliente con demostraciones de código, consulta el tutorial sobre el <a href="/tutorials/offline/storage/">almacenamiento del cliente</a>.

source: Mark Pilgrim dives into using the storage APIs.
es: Mark Pilgrim explica en detalle cómo utilizar las API de almacenamiento.

source: Mozilla Developer Center on Web Storage.
es: Mozilla Developer Center en Web Storage

source: Mozilla Developer Center on IndexedDB.
es: Mozilla Developer Center en IndexedDB

source: Creating a todo list manager using localStorage, app cache and offline events.
es: Creación de un administrador de listas de tareas pendientes utilizando localStorage, la caché de aplicaciones y eventos sin conexión

source: Mozilla explains its views on Web SQL Database and Indexed Database
es: Mozilla explica su opinión sobre Web SQL Database e Indexed Database.

source: Development Tools
es: Herramientas de desarrollo

source: Compatibility
es: Compatibilidad

source: Inspiration
es: Inspiración

source: Posts & Tutorials
es: Publicaciones y tutoriales

source: Article
es: Artículo

source: Announcement
es: Anuncio

source: Sample
es: Ejemplo

source: Tags
es: Etiquetas

source: Comma separated list of tags: workers,filesystem,file,...
es: Lista de etiquetas separada con comas: trabajadores,sistemadearchivos,archivo,…

source: Filtering by tag
es: Filtrado por etiqueta

source: [Clear filter]
es: [Borrar filtro]

source: Null character in input stream, replaced with U+FFFD.
es: Carácter nulo en el stream de entrada. Se ha sustituido por U+FFFD

source: Invalid codepoint in stream.
es: Punto de código no válido en el stream

source: Solidus (/) incorrectly placed in tag.
es: La barra oblicua (/) no está colocada correctamente en la etiqueta.

source: Incorrect CR newline entity, replaced with LF.
es: Entidad de nueva línea CR incorrecta y sustituida por LF

source: Entity used with illegal number (windows-1252 reference).
es: Entidad utilizada con número no permitido (referencia windows-1252)

source: Numeric entity couldn't be converted to character (codepoint U+%(charAsInt)08x).
es: La entidad numérica no se ha podido convertir en el carácter (punto de código U+%(charAsInt)08x).

source: Numeric entity represents an illegal codepoint: U+%(charAsInt)08x.
es: La entidad numérica representa un punto de código no permitido: U+%(charAsInt)08x.

source: Numeric entity didn't end with ';'.
es: La entidad numérica no termina en ";".

source: Numeric entity expected. Got end of file instead.
es: Entidad numérica esperada. Se ha obtenido el final de archivo en su lugar.

source: Numeric entity expected but none found.
es: Entidad numérica esperada, pero no encontrada

source: Named entity didn't end with ';'.
es: La entidad con nombre no termina en ";".

source: Named entity expected. Got none.
es: Se esperaba una entidad con nombre, pero no se ha obtenido ninguna.

source: End tag contains unexpected attributes.
es: La etiqueta de cierre contiene atributos inesperados.

source: Expected tag name. Got '>' instead.
es: Se esperaba un nombre de etiqueta, pero se ha obtenido ">" en su lugar.

source: Expected tag name. Got '?' instead. (HTML doesn't support processing instructions.)
es: Se esperaba un nombre de etiqueta, pero se ha obtenido "?" en su lugar. (HTML no admite instrucciones de procesamiento).

source: Expected tag name. Got something else instead
es: Se esperaba el nombre de etiqueta. Se ha obtenido un elemento diferente en su lugar.

source: Expected closing tag. Got '>' instead. Ignoring '</>'.
es: Se esperaba una etiqueta de cierre, pero se ha obtenido ">" en su lugar. "</>" ignorado.

source: Expected closing tag. Unexpected end of file.
es: Final de archivo inesperado. Se esperaba la etiqueta de cierre.

source: Expected closing tag. Unexpected character '%(data)s' found.
es: Se esperaba la etiqueta de cierre. Se ha encontrado el carácter inesperado "%(data)s".

source: Unexpected end of file in the tag name.
es: Final de archivo inesperado en el nombre de etiqueta

source: Unexpected end of file. Expected attribute name instead.
es: Final de archivo inesperado. Se esperaba el nombre de atributo en su lugar.

source: Unexpected end of file in attribute name.
es: Final de archivo inesperado en el nombre de atributo

source: Invalid chracter in attribute name
es: Carácter no válido en el nombre de atributo

source: Dropped duplicate attribute on tag.
es: Se ha soltado un atributo duplicado en la etiqueta.

source: Unexpected end of file. Expected = or end of tag.
es: Final de archivo inesperado. Se esperaba "=" o el final de la etiqueta.

source: Unexpected end of file. Expected attribute value.
es: Final de archivo inesperado. Se esperaba el valor del atributo.

source: Expected attribute value. Got '>' instead.
es: Se esperaba el valor del atributo. Se ha obtenido ">" en su lugar.

source: Unexpected end of file in attribute value (").
es: Final de archivo inesperado en el valor del atributo (")

source: Unexpected end of file in attribute value (').
es: Final de archivo inesperado en el valor del atributo (')

source: Unexpected end of file in attribute value.
es: Final de archivo inesperado en el valor del atributo

source: Unexpected end of file in tag. Expected >
es: Final de archivo inesperado en la etiqueta. Se esperaba ">".

source: Unexpected character after / in tag. Expected >
es: Carácter inesperado después de "/" en la etiqueta. Se esperaba ">".

source: Expected '--' or 'DOCTYPE'. Not found.
es: Se esperaba "--" o "DOCTYPE", pero no se ha encontrado el elemento.

source: Incorrect comment.
es: Comentario incorrecto

source: Unexpected end of file in comment.
es: Final de archivo inesperado en el comentario

source: Unexpected end of file in comment (-)
es: Final de archivo inesperado en el comentario (-)

source: Unexpected '-' after '--' found in comment.
es: "-" inesperado encontrado después de "--" en el comentario

source: Unexpected end of file in comment (--).
es: Final de archivo inesperado en comentario (--)

source: Unexpected character in comment found.
es: Se ha encontrado un carácter inesperado en el comentario.

source: No space after literal string 'DOCTYPE'.
es: No hay un espacio después de la cadena literal "DOCTYPE"

source: Unexpected > character. Expected DOCTYPE name.
es: Carácter ">" inesperado. Se esperaba el nombre de DOCTYPE.

source: Unexpected end of file. Expected DOCTYPE name.
es: Final de archivo inesperado. Se esperaba el nombre de DOCTYPE.

source: Unexpected end of file in DOCTYPE name.
es: Final de archivo inesperado en el nombre de DOCTYPE

source: Unexpected end of file in DOCTYPE.
es: Final de archivo inesperado en DOCTYPE

source: Expected space or '>'. Got '%(data)s'
es: Se esperaba un espacio o ">". Se ha obtenido "%(data)s".

source: Unexpected end of DOCTYPE.
es: Final de DOCTYPE inesperado

source: Unexpected character in DOCTYPE.
es: Carácter inesperado en DOCTYPE

source: XXX innerHTML EOF
es: Final de archivo innerHTML XXX

source: Unexpected DOCTYPE. Ignored.
es: DOCTYPE inesperado (ignorado)

source: html needs to be the first start tag.
es: HTML debe ser la primera etiqueta de inicio.

source: Unexpected End of file. Expected DOCTYPE.
es: Final de archivo inesperado. Se esperaba DOCTYPE.

source: Erroneous DOCTYPE.
es: DOCTYPE erróneo

source: Unexpected non-space characters. Expected DOCTYPE.
es: Caracteres sin espacios inesperados. Se esperaba DOCTYPE.

source: Unexpected start tag (%(name)s). Expected DOCTYPE.
es: Etiqueta de inicio (%(name)s) inesperada. Se esperaba DOCTYPE.

source: Unexpected end tag (%(name)s). Expected DOCTYPE.
es: Etiqueta de cierre inesperada (%(name)s). Se esperaba DOCTYPE.

source: Unexpected end tag (%(name)s) after the (implied) root element.
es: Etiqueta de cierre inesperada (%(name)s) después del elemento raíz (implícito)

source: Unexpected end of file. Expected end tag (%(name)s).
es: Final de archivo inesperado. Se esperaba la etiqueta de cierre (%(name)s).

source: Unexpected start tag head in existing head. Ignored.
es: Encabezado de etiqueta de inicio inesperado en el encabezado existente (ignorado)

source: Unexpected end tag (%(name)s). Ignored.
es: Etiqueta de cierre inesperada (%(name)s) (ignorada)

source: Unexpected start tag (%(name)s) that can be in head. Moved.
es: Se ha movido la etiqueta de inicio inesperada (%(name)s) que puede estar en el encabezado.

source: Unexpected start tag (%(name)s).
es: Etiqueta de inicio inesperada (%(name)s)

source: Missing end tag (%(name)s).
es: Falta la etiqueta de cierre (%(name)s).

source: Missing end tags (%(name)s).
es: Faltan las etiquetas de cierre (%(name)s).

source: Unexpected start tag (%(startName)s) implies end tag (%(endName)s).
es: La etiqueta de inicio inesperada (%(startName)s) implica una etiqueta de cierre (%(endName)s).

source: Unexpected start tag (%(originalName)s). Treated as %(newName)s.
es: Etiqueta de inicio inesperada (%(originalName)s). Se ha tratado como %(newName)s.

source: Unexpected start tag %(name)s. Don't use it!
es: Etiqueta de inicio inesperada: %(name)s. ¡No la uses!

source: Unexpected start tag %(name)s. Ignored.
es: Etiqueta de inicio inesperada %(name)s (ignorada)

source: Unexpected end tag (%(gotName)s). Missing end tag (%(expectedName)s).
es: Etiqueta de cierre inesperada (%(gotName)s). Falta la etiqueta de cierre (%(expectedName)s).

source: End tag (%(name)s) seen too early. Expected other end tag.
es: La etiqueta de cierre (%(name)s) ha aparecido demasiado pronto. Se esperaba otra etiqueta de cierre.

source: Unexpected end tag (%(gotName)s). Expected end tag (%(expectedName)s).
es: Etiqueta de cierre inesperada (%(gotName)s). Se esperaba la etiqueta de cierre (%(expectedName)s).

source: End tag (%(name)s) seen too early. Ignored.
es: La etiqueta de cierre (%(name)s) ha aparecido demasiado pronto (ignorada).

source: End tag (%(name)s) violates step 1, paragraph 1 of the adoption agency algorithm.
es: La etiqueta de cierre (%(name)s) infringe el párrafo 1 del paso 1 del algoritmo de la agencia de adopción.

source: End tag (%(name)s) violates step 1, paragraph 2 of the adoption agency algorithm.
es: La etiqueta de cierre (%(name)s) infringe el párrafo 2 del paso 1 del algoritmo de la agencia de adopción

source: End tag (%(name)s) violates step 1, paragraph 3 of the adoption agency algorithm.
es: La etiqueta de cierre (%(name)s) infringe el párrafo 3 del paso 1 del algoritmo de la agencia de adopción

source: Unexpected end tag (%(originalName)s). Treated as %(newName)s.
es: Etiqueta de cierre inesperada (%(originalName)s). Se ha tratado como %(newName)s.

source: This element (%(name)s) has no end tag.
es: Este elemento (%(name)s) no tiene etiqueta de cierre.

source: Unexpected implied end tag (%(name)s) in the table phase.
es: Etiqueta de cierre implícita inesperada (%(name)s) en la fase de la tabla

source: Unexpected implied end tag (%(name)s) in the table body phase.
es: Etiqueta de cierre implícita inesperada (%(name)s) en la fase del cuerpo de la tabla

source: Unexpected non-space characters in table context caused voodoo mode.
es: Los caracteres sin espacios inesperados en el contexto de la tabla han dado lugar al modo vudú.

source: Unexpected input with type hidden in table context.
es: Entrada inesperada con tipo oculto en el contexto de la tabla

source: Unexpected form in table context.
es: Formato inesperado en el contexto de la tabla

source: Unexpected start tag (%(name)s) in table context caused voodoo mode.
es: La etiqueta de inicio inesperada (%(name)s) en el contexto de la tabla ha dado lugar al modo vudú.

source: Unexpected end tag (%(name)s) in table context caused voodoo mode.
es: La etiqueta de cierre inesperada (%(name)s) en el contexto de la tabla ha dado lugar al modo vudú.

source: Unexpected table cell start tag (%(name)s) in the table body phase.
es: Etiqueta de inicio de celda de la tabla inesperada (%(name)s) en la fase del cuerpo de la tabla

source: Got table cell end tag (%(name)s) while required end tags are missing.
es: Se ha obtenido una etiqueta de cierre de celda de la tabla (%(name)s), aunque faltan las etiquetas de cierre obligatorias.

source: Unexpected end tag (%(name)s) in the table body phase. Ignored.
es: Etiqueta de cierre inesperada (%(name)s) en la fase del cuerpo de la tabla (ignorada)

source: Unexpected implied end tag (%(name)s) in the table row phase.
es: Etiqueta de cierre implícita inesperada (%(name)s) en la fase de filas de la tabla

source: Unexpected end tag (%(name)s) in the table row phase. Ignored.
es: Etiqueta de cierre inesperada (%(name)s) en la fase de filas de la tabla (ignorada)

source: Unexpected select start tag in the select phase treated as select end tag.
es: La etiqueta de inicio de selección inesperada en la fase de selección se ha tratado como la etiqueta de cierre de selección.

source: Unexpected input start tag in the select phase.
es: Etiqueta de inicio de entrada inesperada en la fase de selección

source: Unexpected start tag token (%(name)s in the select phase. Ignored.
es: Token de etiqueta de inicio inesperado (%(name)s) en la fase de selección (ignorado)

source: Unexpected end tag (%(name)s) in the select phase. Ignored.
es: Etiqueta de cierre inesperada (%(name)s) en la fase de selección (ignorada)

source: Unexpected table element start tag (%(name)s) in the select in table phase.
es: Etiqueta de inicio de elemento de la tabla inesperada (%(name)s) en la fase de selección en la tabla

source: Unexpected table element end tag (%(name)s) in the select in table phase.
es: Etiqueta de cierre de elemento de la tabla inesperada (%(name)s) en la fase de selección en la tabla

source: Unexpected non-space characters in the after body phase.
es: Caracteres sin espacios no esperados en la fase posterior al cuerpo

source: Unexpected start tag token (%(name)s) in the after body phase.
es: Token de etiqueta de inicio inesperado (%(name)s) en la fase posterior del cuerpo

source: Unexpected end tag token (%(name)s) in the after body phase.
es: Token de etiqueta de cierre inesperado (%(name)s) en la fase posterior al cuerpo

source: Unepxected characters in the frameset phase. Characters ignored.
es: Caracteres inesperados en la fase del conjunto de marcos (caracteres ignorados)

source: Unexpected start tag token (%(name)s) in the frameset phase. Ignored.
es: Token de etiqueta de inicio inesperado (%(name)s) en la fase del conjunto de marcos (ignorado)

source: Unexpected end tag token (frameset) in the frameset phase (innerHTML).
es: Token de etiqueta de cierre inesperado (conjunto de marcos) en la fase del conjunto de marcos (innerHTML)

source: Unexpected end tag token (%(name)s) in the frameset phase. Ignored.
es: Token de etiqueta de cierre inesperado (%(name)s) en la fase del conjunto de marcos (ignorado)

source: Unexpected non-space characters in the after frameset phase. Ignored.
es: Caracteres sin espacios inesperados en la fase posterior al conjunto de marcos (ignorados)

source: Unexpected start tag (%(name)s) in the after frameset phase. Ignored.
es: Etiqueta de inicio inesperada (%(name)s) en la fase posterior del conjunto de marcos (ignorada)

source: Unexpected end tag (%(name)s) in the after frameset phase. Ignored.
es: Etiqueta de cierre inesperada (%(name)s) en la fase posterior del conjunto de marcos. Se ha ignorado.

source: Unexpected end tag after body(innerHtml)
es: Etiqueta de cierre inesperada después del cuerpo (innerHtml)

source: Unexpected non-space characters. Expected end of file.
es: Caracteres sin espacios inesperados. Se esperaba el final de archivo.

source: Unexpected start tag (%(name)s). Expected end of file.
es: Etiqueta de inicio inesperada (%(name)s). Se esperaba el final de archivo.

source: Unexpected end tag (%(name)s). Expected end of file.
es: Etiqueta de cierre inesperada (%(name)s). Se esperaba el final de archivo.

source: Unexpected end of file. Expected table content.
es: Final de archivo inesperado. Se esperaba el contenido de la tabla.

source: Unexpected end of file. Expected select content.
es: Final de archivo inesperado. Se esperaba el contenido seleccionado.

source: Unexpected end of file. Expected frameset content.
es: Final de archivo inesperado. Se esperaba el contenido del conjunto de marcos.

source: Unexpected end of file. Expected script content.
es: Final de archivo inesperado. Se esperaba el contenido de la secuencia de comandos.

source: Trailing solidus not allowed on element %(name)s
es: No se permite la barra oblicua en el elemento %(name)s.

source: Element %(name)s not allowed in a non-html context
es: El elemento %(name)s no está permitido en un contexto que no sea HTML.

source: Unexpected end tag (%(name)s) before html.
es: Etiqueta de cierre inesperada (%(name)s) antes de HTML

source: StartTag not in PCDATA content model flag: %(tag)s
es: La etiqueta de inicio no está en el indicador del modelo de contenido PCDATA: %(tag)s

source: Tag name is not a string: %(tag)r
es: El nombre de la etiqueta no es una cadena: %(tag)r

source: Empty tag name
es: Nombre de etiqueta vacío

source: Void element reported as StartTag token: %(tag)s
es: Elemento nulo notificado como token de etiqueta de inicio: %(tag)s

source: Non-void element reported as EmptyTag token: %(tag)s
es: Elemento no nulo notificado como token de etiqueta vacía: %(tag)s

source: Attribute name is not a string: %(name)r
es: El nombre del atributo no es una cadena: %(name)r

source: Empty attribute name
es: Nombre del atributo vacío

source: Attribute value is not a string: %(value)r
es: El valor del atributo no es una cadena: %(value)r

source: Void element reported as EndTag token: %(tag)s
es: Elemento vacío notificado como token de etiqueta de cierre: %(tag)s

source: EndTag (%(end)s) does not match StartTag (%(start)s)
es: La etiqueta de cierre (%(end)s) no coincide con la etiqueta de inicio (%(start)s).

source: Comment not in PCDATA content model flag
es: El comentario no está incluido en el indicador del modelo de contenido PCDATA.

source: %(type)s token with empty data
es: Token %(type)s sin datos

source: Non-space character(s) found in SpaceCharacters token: %(token)r
es: Se han encontrado caracteres sin espacios en el token de caracteres de espacio: %(token)r

source: Doctype not in PCDATA content model flag: %(name)s
es: El tipo de contenido no está incluido en el indicador del modelo de contenido PCDATA: %(name)s

source: Unknown token type: %(type)s
es: Tipo de token desconocido: %(type)s

source: System identifer contains both single and double quote characters
es: El identificador del sistema contiene caracteres con comillas simples y dobles.

source: Unexpected </ in CDATA
es: "</" inesperado en CDATA

source: Unexpected child element of a CDATA element
es: Elemento secundario de un elemento CDATA inesperado

source: Comment contains --
es: El comentario contiene "--".

source: Void element has children
es: El elemento nulo contiene elementos secundarios.

source: Unknown node type:
es: Tipo de nodo desconocido:

source: Text nodes are text or tail, found %s
es: Los nodos de texto son texto o cola. Se ha encontrado %s.

source: Text nodes have no children
es: Los nodos de texto no tienen elementos secundarios.

source: 404 - Page Not Found
es: Error 404 (no se encuentra la página)

source: I pity da foo who doesn't use HTML5!
es: ¡Pobres de aquellos que no utilizan HTML5!

source: 500 - Server Error
es: 500 - Error del Servidor

source: &#x2639; Something went wrong.
es: &#x2639; Algo anda mal.

source: Except as otherwise <a href="http://code.google.com/policies.html#restrictions">noted</a>, the content of this page is licensed under the <a href="http://creativecommons.org/licenses/by/3.0/">Creative Commons Attribution 3.0 License</a>, and code samples are licensed under the <a href="http://www.apache.org/licenses/LICENSE-2.0">Apache 2.0 License</a>.
es: Salvo <a href="http://code.google.com/policies.html#restrictions">disposición</a> en contra, el contenido de esta página está sujeto a la <a href="http://creativecommons.org/licenses/by/3.0/">licencia Reconocimiento 3.0 de Creative Commons</a> y los ejemplos de código a la <a href="http://www.apache.org/licenses/LICENSE-2.0">licencia Apache 2.0</a>.

source: Please enable JavaScript to view the comments powered by Disqus.
es: Debes habilitar JavaScript para ver los comentarios con la tecnología de Disqus.

source: HTML5 Rocks RSS
es: Feed RSS de HTML5 Rocks

source: Posts &amp; Tutorials
es: Publicaciones y Tutoriales

source: Slides
es: Diapositivas

source: Who We Are
es: Quiénes somos

source: Search
es: Búsqueda

source: Intro
es: Introducción

source: Demos
es: Demostraciones

source: In the Wild
es: En estado puro
