Repository: lzcabrera/www.html5rocks.com
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: es

source: As examples, the File APIs can be used to create a thumbnail preview of images as they're being sent to the server, or allow an app to save a file reference while the user is offline. Using the <a href="https://dvcs.w3.org/hg/audio/raw-file/tip/webaudio/specification.html">Web Audio API</a>, your app could read an .mp3 file and display a visualization of the song as it plays. Additionally, you could use client-side logic to verify an upload's mimetype matches its file extension or restrict the size of an upload.
es: Las API de archivos se pueden utilizar, por ejemplo, para crear una vista previa en miniatura de las imágenes que se envían al servidor o para permitir que una aplicación guarde un archivo de referencia mientras el usuario no está conectado. Con el <a href="https://dvcs.w3.org/hg/audio/raw-file/tip/webaudio/specification.html">API de audio web</a>, la aplicación podría leer un archivo .mp3 y mostrar una visualización de la canción mientras se reproduce. También se podría utilizar lógica de cliente para verificar si el tipo MIME de un archivo subido coincide con su extensión o para limitar el tamaño de una subida.

source: This W3C specification defines the File APIs: <code>File</code>, <code>FileList</code>, <code>FileReader</code>, <code>Blob</code>.
es: Esta especificación W3C define las API de archivos <code>File</code>, <code>FileList</code>, <code>FileReader</code> y <code>Blob</code>.

source: This W3C specification defines the FileSystem APIs; which provide an interface for reading and writing files and directories in a sandboxed file system.
es: La especificación W3C define las API de sistemas de archivos (FileSystem APIs), lo que proporciona una interfaz para leer y escribir archivos y directorios en un sistema de archivos protegido.

source: This W3C specification defines the FileWriter API; which provides an interface for writing to files from web applications.
es: La especificación W3C define el API de escritura de archivos (FileWriter API),lo que proporciona una interfaz para escribir en archivos de aplicaciones web.

source: This W3C specification defines the ProgressEvent; which gives asynchronous updates on the progress of a File read.
es: Esta especificación W3C define el objeto ProgressEvent, que ofrece actualizaciones asíncronas sobre el progreso de la lectura de un archivo.

source: This whatwg specification defines the native HTML5 drag and drop APIs
es: Esta especificación whatwg define las API nativas de la función de arrastrar y soltar de HTML5.

source: Tutorial on using Drag and Drop, FileAPI and XMLHttpRequest to upload files.
es: Tutorial sobre el uso de la función de arrastrar y soltar, el API de archivos (FileAPI) y XMLHttpRequest para subir archivos

source: Reference on the various dragging options that are available in the DnD API
es: Referencia sobre las diferentes opciones de arrastre disponibles en el API de la función de arrastrar y soltar (DnD API)

source: Article on using Native Drag and Drop in HTML5. Discusses File drag/drop from desktop.
es: Artículo sobre el uso de la función de arrastrar y soltar nativa en HTML5 que proporciona información sobre cómo arrastrar y soltar archivos desde el escritorio

source: Graphics
es: Gráficos

source: The web has always been a visual medium, but a restricted one at best. Until recently, HTML developers were limited to CSS and JavaScript in order to produce animations or visual effects for their websites, or they would have to rely on a plugin like Flash.
es: La Web ha sido siempre un medio visual, pero restringido en el mejor de los casos. Hasta hace poco, los desarrolladores de HTML solo podían utilizar CSS y JavaScript para crear animaciones o efectos visuales para sus sitios web, o tenían que recurrir a complementos como Flash.

source: With the addition of technologies like the canvas element, Web GL, and SVG images, this is no longer the case! In fact, there are many new features which deal with graphics on the web: 2D Canvas, WebGL, SVG, 3D CSS transforms, and SMIL.
es: Sin embargo, esta situación ha cambiado con la incorporación de tecnologías como el elemento canvas, la especificación WebGL y las imágenes SVG. De hecho, hay muchas funciones nuevas que permiten crear gráficos en la Web: Canvas 2D, WebGL, SVG, las transformaciones 3D de CSS y ​​el estándar SMIL.

source: Of course, none of these new technologies would be useful if they weren&rsquo;t capable of running fast. Thankfully, JavaScript engines have become fast enough to run 3D games and manipulate video in realtime. Hardware accelerated compositing is also being implemented in many browsers, meaning that even CSS transitions and transforms will be butter-smooth.
es: Es obvio que ninguna de estas nuevas tecnologías sería útil si no pudiera ejecutarse con rapidez. Afortunadamente, los motores de JavaScript actuales son lo suficientemente rápidos como para ejecutar juegos 3D y manipular vídeos en tiempo real. La composición acelerada por hardware también se está implementando en muchos navegadores, lo que significa que incluso las transformaciones y transiciones con CSS serán pan comido.

source: Developers are taking advantage of these features: a flood of HTML graphics demos have been showing up on the web, ranging from implementations of old 2D graphics algorithms, to brand new techniques created specifically for the modern web.
es: Los desarrolladores ya están utilizando estas funciones, por lo que cada vez hay más gráficos en HTML, que abarcan desde implementaciones de antiguos algoritmos de gráficos 2D hasta técnicas completamente nuevas desarrolladas expresamente para la Web actual.

source: Browser Support
es: Compatibilidad con el navegador

source: &ldquo;Graphics&rdquo; is such a wide topic that there are several specifications being worked on. A comprehensive graphics demo may use several of the following:
es: Los &ldquo;gráficos&ldquo; abarcan tantas cosas que se está trabajando en varias especificaciones relacionadas con ellos. En una demostración de gráficos completa, se pueden utilizar algunos de los siguientes elementos:

source: PNG Alpha Transparency
es: Transparencia alfa en PNG

source: Data URLs
es: URL de datos

source: CSS3 Colors
es: Colores CSS3

source: SVG (basic support)
es: SVG (compatibilidad básica)

source: Canvas (basic support)
es: Canvas (compatibilidad básica)

source: Video element
es: Elemento de vídeo

source: CSS Transforms
es: Transformaciones CSS

source: Text API for Canvas
es: API de texto para canvas

source: SVG in CSS Backgrounds
es: SVG en fondos CSS

source: SVG effects for HTML elements
es: Efectos SVG para elementos HTML

source: SVG SMIL animation
es: Animación SVG SMIL

source: SVG Fonts
es: Fuentes SVG

source: SVG filters
es: Filtros SVG

source: CSS3 Animation
es: Animación CSS3

source: Inline SVG in HTML5
es: SVG en línea en HTML5

source: 3D Canvas graphics / WebGL
es: Gráficos 3D en canvas/WebGL

source: CSS 3D Transforms
es: Transformaciones 3D CSS

source: Click each specification to see its support status on <a href="http://caniuse.com/">caniuse.com</a>. Chrome-specific details can be found on the <a href="http://dev.chromium.org/developers/web-platform-status">Chrome Platform Status</a>.
es: Haz clic en cada una de las especificaciones para ver su estado de compatibilidad en <a href="http://caniuse.com/">caniuse.com</a>. Puedes encontrar información detallada específica sobre el estado de la plataforma Chrome en <a href="http://dev.chromium.org/developers/web-platform-status">esta página</a>.

source: Various WebGL / canvas demos which take advantage of HW accel
es: Varias demostraciones del elemento canvas o WebGL que se benefician de la aceleración por hardware

source: WebGL solid modeling CAD
es: CAD de modelado sólido WebGL

source: 3D effects without WebGL
es: Efectos 3D sin WebGL

source: Nicely polished canvas experiments
es: Experimentos con canvas muy conseguidos

source: Old-school games effect
es: Efecto de juegos retro

source: Various canvas demos which take advantage of HW accel
es: Varias demostraciones del elemento canvas que se benefician de la aceleración por hardware

source: Nice integration between video and canvas
es: Buena integración del vídeo y el elemento canvas

source: Support SVG on all browsers
es: Compatibilidad con SVG en todos los navegadores

source: SVG, CSS, Canvas support for Illustrator
es: Compatibilidad con SVG, CSS y Canvas para Illustrator

source: Animation library wrapping SVG
es: Biblioteca de animación que envuelve SVG

source: JavaScript scenegraph library for the canvas element
es: Biblioteca de escenas gráficas de JavaScript para el elemento canvas

source: Port of Processing animation scripting language to JavaScript - uses canvas
es: Migración del lenguaje de secuencias de comandos de animación de procesamiento a JavaScript (utiliza canvas)

source: Lightweight 3D engine, uses canvas, SVG, WebGL
es: Motor 3D ligero que utiliza canvas, SVG y WebGL

source: Background and details on the implementation of hardware accelerated compositing in Chrome
es: Información previa y detallada sobre la implementación de la composición acelerada por hardware en Chrome

source: Features
es: Características

source: Audio and Video became first-class citizens on the Web with HTML5 the same way that other media types like images did in the past. Through their new APIs you can access, control and manipulate timeline data and network states of the files. With the coming additions to the APIs you will be able to read and write raw data to audio files (Audio Data API) or manipulate captions in videos (Timed Track API). But the real power of these new HTML elements stands out when they are combined with the other technologies of the web stack, be it Canvas, SVG, CSS or even WebGL.
es: Con HTML5, el audio y el vídeo se han convertido en lo más importante de la Web, tal como ocurrió en el pasado con otro tipo de contenido multimedia, como las imágenes. Las nuevas API permiten manipular los estados de red y los datos cronológicos de los archivos, controlarlos y acceder a ellos. Próximamente se añadirán nuevos elementos a las API que permitirán leer y escribir datos sin procesar en archivos de audio (API de datos de audio, Audio Data API) o manipular subtítulos de vídeos (API de pistas temporizadas, Timed Track API). Sin embargo, las auténticas posibilidades de estos nuevos elementos HTML se descubren al combinarlos con otras tecnologías existentes en la Web, como el elemento canvas, la especificación SVG, el lenguaje CSS e incluso la especificación WebGL.

source: For instance, you can build a DJ mixer table app where you show several controls to fade and mix audio tracks. Canvas lets you read pixel data from videos so you could add a video visualizer with a scene selection feature and, on top of that, use SVG filters &aacute; la Photoshop to distort the movie while the videos are playing.
es: Por ejemplo, puedes crear una aplicación de mesa de mezclas para DJ que tenga varios controles para atenuar o mezclar canciones. El elemento canvas permite leer datos de píxeles de vídeos, así que podrías añadir un visualizador de vídeo con una función de selección de escena y utilizar además filtros SVG al estilo Photoshop para distorsionar la película mientras se reproducen los vídeos.

source: This W3C specification defines the audio element with all the available methods, attributes and events.
es: La especificación W3C define el elemento de audio con todos los métodos, atributos y eventos disponibles.

source: This W3C specification defines the video element with all the available methods, attributes and events.
es: Esta especificación W3C define el elemento de vídeo con todos los métodos, atributos y eventos disponibles.

source: This W3C specification defines those methods and properties which are common to both audio and video elements.
es: Esta especificación W3C define los métodos y las propiedades que son comunes para los elementos de vídeo y de audio.

source: A subset of the media element spec currently being written where it defines means to handle metadata of audio/video files such as captions and subtitles.
es: Un subconjunto de la especificación de elementos de medios que se está elaborando actualmente en el que se definen medios para procesar metadatos de archivos de audio y vídeo como, por ejemplo, subtítulos.

source: Draft recommendation for Audio Data API where methods are defined to read and write spectrum data of audio files.
es: Recomendación de borrador para el API de datos de audio, donde los métodos se definen para leer y escribir datos de espectro de archivos de audio

source: Nuts & Bolts
es: Elementos básicos

source: HTML5 is now an umbrella term that many people use to describe the amazing improvements coming to the web platform. It's a platform that is becoming more powerful by the day. Most people have heard of the rich APIs (css3, audio/video, WebGL, offline, geolocation,...), but there's also a slew of lesser-known features that you should be aware of. We call these the "nuts &amp; bolts" of building modern web applications.
es: HTML5 es un término genérico que se utiliza mucho en la actualidad para describir las increíbles mejoras que se están produciendo en la Web, que ofrece cada vez más posibilidades. Casi todo el mundo ha oído hablar de las API de contenido enriquecido (CSS3, audio/vídeo, WebGL, sin conexión, ubicación geográfica...), pero también hay una gran cantidad de funciones menos conocidas que es conveniente conocer (los "elementos básicos" de la creación de aplicaciones web modernas).

source: Isn't it painful to build web apps? Luckily, smart folks are improving the underlying (core) platform to make our lives easier. These improvements include additions to ECMAScript (the JavaScript language), ways to interact with the DOM, and even old friends like <code>XMLHttpRequest</code> and <code>&lt;input type="file"&gt;</code>. Here are just a few:
es: Crear aplicaciones web no es nada fácil, ¿verdad? Por suerte, algunos expertos están mejorando la plataforma subyacente (central) para facilitar las cosas. Estas mejoras incluyen la incorporación de elementos a ECMAScript (el lenguaje de JavaScript), la presentación de formas de interactuar con el modelo DOM e, incluso, viejos amigos como <code>XMLHttpRequest</code> y <code>&lt;input type="file"&gt;</code>. A continuación te mostramos algunos ejemplos:

source: JavaScript <a href="https://developer.mozilla.org/en/JavaScript_typed_arrays">Typed Arrays</a>
es: <a href="https://developer.mozilla.org/es/JavaScript_typed_arrays">Conjuntos escritos</a> de JavaScript

source: New selectors: <a href="http://slides.html5rocks.com/#new-selectors"><code>querySelector()</code></a>, <a href="http://slides.html5rocks.com/#new-selectors"><code>querySelectorAll()</code></a>, <a href="http://html5-demos.appspot.com/static/html5-whats-new/template/index.html#13"><code>matchesSelector()</code></a>
es: Nuevos selectores: <a href="http://slides.html5rocks.com/#new-selectors"><code>querySelector()</code></a>, <a href="http://slides.html5rocks.com/#new-selectors"><code>querySelectorAll()</code></a>, <a href="http://html5-demos.appspot.com/static/html5-whats-new/template/index.html#13"><code>matchesSelector()</code></a>

source: Custom data-* attributes: <a href="http://html5-demos.appspot.com/static/html5-whats-new/template/index.html#12"><code>Element.dataset</code></a>
es: Atributos Custom data-*: <a href="http://html5-demos.appspot.com/static/html5-whats-new/template/index.html#12"><code>Element.dataset</code></a>

source: <a href="http://dvcs.w3.org/hg/domcore/raw-file/tip/Overview.html#mutation-observers">Mutation Observers</a>
es: <a href="http://dvcs.w3.org/hg/domcore/raw-file/tip/Overview.html#mutation-observers">Observadores de mutaciones</a>

source: <a href="http://hacks.mozilla.org/2011/11/html5-context-menus-in-firefox-screencast-and-code/">Context menus</a>
es: <a href="http://hacks.mozilla.org/2011/11/html5-context-menus-in-firefox-screencast-and-code/">Menús contextuales</a>

source: These additions make apps easier to build, offload more work to the browser, and reduce your footprint (e.g. by removing the need for libraries that handle the same functionality).
es: Estas incorporaciones facilitan la creación de aplicaciones, permiten delegar más trabajo en el navegador y reducen el espacio ocupado (por ejemplo, al eliminar la necesidad de utilizar bibliotecas que desempeñan las mismas funciones).

source: With smarter APIs, we can build smarter apps
es: Con API más inteligentes, se pueden crear aplicaciones más inteligentes

source: The platform includes APIs that give you greater insight into what is happening in your application. These APIs allow you to make smarter choices in your app, save battery/CPU, and create a better user experience.
es: La plataforma incluye API que te proporcionan más información sobre lo que ocurre en tu aplicación. Esas API te permiten tomar mejores decisiones para tu aplicación, ahorrar batería/CPU y crear una mejor experiencia para el usuario.

source: Smarter animations: <code>window.requestAnimationFrame()</code>
es: Animaciones más inteligentes: <code>window.requestAnimationFrame()</code>

source: Form factor detection: <a href="http://html5-demos.appspot.com/static/html5-whats-new/template/index.html#16"><code>window.matchMedia()</code></a> and CSS media queries.</code>
es: Detección de dimensiones: <a href="http://html5-demos.appspot.com/static/html5-whats-new/template/index.html#16"><code>window.matchMedia()</code></a> y consultas de medios de CSS</code>

source: <a href="http://slides.html5rocks.com/#history-api">History API</a>
es: <a href="http://slides.html5rocks.com/#history-api">API de History</a>

source: <a href="http://updates.html5rocks.com/2011/06/Page-Visibility-API-Have-I-got-your-attention">Page Visibility API</a>
es: <a href="http://updates.html5rocks.com/2011/06/Page-Visibility-API-Have-I-got-your-attention">API de visibilidad de páginas</a>

source: <a href="https://developer.mozilla.org/en/Online_and_offline_eventsion">online/offline events</a>
es: <a href="https://developer.mozilla.org/es/Online_and_offline_events">eventos online/sin conexión</a>

source: <a href="http://html5-demos.appspot.com/static/html5-whats-new/template/index.html#28">Custom protocol/content handlers</a>
es: <a href="http://html5-demos.appspot.com/static/html5-whats-new/template/index.html#28">Controladores personalizados de protocolos/contenido</a>

source: Whitepaper on using the Page Visibility API.
es: Información sobre el uso del API de visibilidad de páginas

source: How to use the <code>rel='prerender'</code> attribute to prerender content in a background tab.
es: Cómo utilizar el atributo <code>rel='prerender'</code> para el procesamiento previo de contenido en una pestaña en segundo plano

source: MDN reference on online/offline events.
es: Referencia de MDN sobre eventos online/sin conexión

source: MDN reference on JS typed arrays.
es: Referencia de MDN sobre conjuntos escritos de JavaScript

source: MDN refernce on <code>window.requestAnimationFrame()</code>
es: Referencia de MDN sobre <code>window.requestAnimationFrame()</code>

source: MDN reference on the <code>window.history</code> API.
es: Referencia de MDN sobre el API de <code>window.history</code>

source: MDN documentation for <code>navigator.registerProtocolHandler()</code>.
es: Documentación de MDN sobre <code>navigator.registerProtocolHandler()</code>

source: MDN documentation for <code>navigator.registerContentHandler()</code>.
es: Documentación de MDN sobre <code>navigator.registerContentHandler()</code>

source: Allows apps to register an intent to handle common user actions.
es: Permite que las aplicaciones registren los intentos de gestión de acciones comunes de los usuarios.

source: MDN reference on using features in <code>XMLHttpRequest2</code>.
es: Referencia de MDN sobre el uso de funciones en <code>XMLHttpRequest2</code>

source: "Web" and "online" are two closely associated terms, downright synonymous to many people. So why on earth would we talk about "offline" web technologies, and what does the term even mean?
es: "Web" y "online" son dos términos que están muy relacionados entre sí, y muchas personas los consideran incluso sinónimos. Por tanto, ¿por qué hablamos de tecnologías web "offline" (sin conexión) y qué significa este término?

source: HTML5 and related specs introduce a number of features to make offline web apps a reality:
es: Las especificaciones de HTML5 y otras especificaciones relacionadas presentan una serie de funciones que permiten que las aplicaciones web sin conexión sean una realidad:

source: application cache
es: caché de aplicaciones

source: web SQL &amp; indexed database
es: Web SQL e Indexed Database

source: online/offline events
es: eventos online o sin conexión

source: For a whirlwind overview of the offline landscape, consider the article <a href="/tutorials/offline/whats-offline/">"Offline": What does it mean and why should I care?</a>. These features can also be used to improve an application&rsquo;s performance by storing data in the cache or to make data persistent between user sessions and when reloading and restoring pages.
es: Para obtener una breve descripción general de la tecnología sin conexión, te recomendamos que consultes el artículo <a href="/tutorials/offline/whats-offline/">"Offline": What does it mean and why should I care?</a> (Sin conexión: ¿qué significa y por qué debería importarme?). Estas funciones también se pueden utilizar para mejorar el rendimiento de una aplicación almacenando datos en la memoria caché o para conservar los datos en diferentes sesiones del usuario y al volver a cargar y restablecer páginas.

source: Presented by Nikolas Coukouma, January 5, 2011
es: Presentado por Nikolas Coukouma, 5 de enero de 2011

source: The w3c spec has the strict details on how the cache.manifest and applicationCache APIs work.
es: La especificación W3C contiene información detallada sobre el funcionamiento de las API de cache.manifest y applicationCache.

source: Mark Pilgrim dives into using the app cache in practice.
es: Mark Pilgrim se sumerge en el uso de la caché de aplicaciones en la práctica.

source: Mozilla Developer Center reference documentation and guides, covering online and offline events and app cache.
es: Guías y documentación de referencia de Mozilla Developer Center en las que se tratan la caché de aplicaciones y eventos online y sin conexión

source: Creating a todo list manager using localStorage, app cache and offline events. Putting everything together.
es: Creación de un administrador de listas de tareas pendientes utilizando localStorage, la caché de aplicaciones y eventos sin conexión, y la unión de todos los elementos

source: The app cache explained with solid examples showing different features and configurations in use.
es: Explicación de la caché de aplicaciones con ejemplos fundamentados que muestran el uso de diferentes configuraciones y funciones

source: The C code used by Webkit for the app cache
es: El código C utilizado por Webkit para la caché de aplicaciones
