Repository: lzcabrera/www.html5rocks.com
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: es

source: Web apps are now able to rival performance of native and desktop applications. By using a variety of techniques and technologies, your sites and apps can feel more responsive and your users will get more done. Performance is important, it's a constant theme across all aspects of your development and product.
es: Las aplicaciones web pueden competir ahora en rendimiento con las aplicaciones nativas y de escritorio. Puedes utilizar una serie de tecnologías y técnicas para ofrecer más facilidades a los usuarios y para que tus aplicaciones y tus sitios tengan una mayor capacidad de respuesta. El rendimiento es un factor importante que está presente continuamente en todos los aspectos del desarrollo y del producto final.

source: Writing fast and responsive apps isn't just important for your users, it's important for your bottom line. For example, <a href="http://googlewebmastercentral.blogspot.com/2010/04/using-site-speed-in-web-search-ranking.html">Google now incorporates site speed in page ranking</a>. <a href="http://exp-platform.com/Documents/2007-10EmetricsExperimenation.pdf">Amazon has found that every 100 ms increase in page load time decreased sales by 1%%</a>. Also, <a href="http://exp-platform.com/Documents/2007-10EmetricsExperimenation.pdf">Microsoft found that slowing a page by 2 seconds decreased ad clicks by 4%%</a>.
es: Crear aplicaciones rápidas y con buena capacidad de respuesta no solo es importante para satisfacer las necesidades de los usuarios, sino también para obtener mejores resultados finales. Por ejemplo, <a href="http://googlewebmastercentral.blogspot.com/2010/04/using-site-speed-in-web-search-ranking.html">Google ahora tiene en cuenta la velocidad de los sitios al determinar su posición en las páginas de resultados</a>. <a href="http://exp-platform.com/Documents/2007-10EmetricsExperimenation.pdf">Amazon ha descubierto que cada 100 ms de aumento en el tiempo de carga de las páginas reduce las ventas en un 1%%</a>. Y también <a href="http://exp-platform.com/Documents/2007-10EmetricsExperimenation.pdf">Microsoft ha observado que los clics en anuncios se reducen en un 4%% al disminuir la velocidad de una página en 2 segundos</a>.

source: Web app optimization cross cuts all aspects of development, from the server to the network to the client. Focusing on performance is critical to success.
es: La optimización de aplicaciones web abarca todos los aspectos del desarrollo, desde el servidor hasta la red y el cliente. Centrarse en el rendimiento es esencial para lograr el éxito.

source: Store locally.
es: Almacenar de forma local

source: Data stored on the client is quicker to access than data stored on the server. Also, data stored closer to the calculation is quicker to access.
es: Se accede más rápido a los datos almacenados en el cliente que a los almacenados en el servidor. También se accede más rápido a los datos almacenados más próximos a los cálculos.

source: Process in the background.
es: Proceso en segundo plano

source: Anything that doesn't help the user see a response to their action should be performed in the background.
es: Cualquier proceso que no ayude al usuario a ver una respuesta a su acción se debe realizar en segundo plano.

source: Minimize connections.
es: Minimizar conexiones

source: Each connection requires work for setup and teardown.
es: Cada conexión requiere un trabajo de configuración y desinstalaión.

source: Decrease bandwidth.
es: Disminuye el ancho de banda

source: Less bandwidth means a faster response.
es: Un menor ancho de banda supone una respuesta más rápida.

source: HTTP caching
es: Almacenamiento en caché HTTP

source: Allow clients and servers to reduce connections and bandwidth.
es: Permite a los clientes y a los servidores reducir las conexiones y el ancho de banda.

source: HTTP caching servers
es: Servidores en caché HTTP

source: Servers like <a href="http://www.varnish-cache.org/">Varnish</a> and <a href="http://www.squid-cache.org/">Squid</a> can cache your content.
es: Los servidores como <a href="http://www.varnish-cache.org/">Varnish</a> y <a href="http://www.squid-cache.org/">Squid</a> pueden almacenar tu contenido en la caché.

source: Efficient server side storage and retrieval of key/value data
es: Recuperación y almacenamiento del servidor eficaz de datos de valores o claves

source: Run JavaScript in the background, in parallel with the main window
es: Ejecuta JavaScript en segundo plano, en paralelo a la ventana principal.

source: Efficient bi-directional streaming communication
es: Comunicación de flujo bidireccional eficaz

source: Local storage
es: Almacenamiento local

source: Client side key/value data storage
es: Almacenamiento de datos de valores o claves del cliente

source: Client side simple object storage
es: Almacenamiento de objetos sencillos del cliente

source: App cache
es: Caché de aplicaciones

source: Caching web app assets locally for offline use
es: Almacenamiento en caché local de elementos de aplicaciones web para uso sin conexión

source: CSS3 transitions and animations
es: Transiciones y animaciones CSS3

source: Native (and possibly hardware accelerated) property changes for elements
es: Cambios en las propiedades de forma nativa (y posiblemente acelerada por hardware) para elementos

source: CSS sprites
es: Objetos móviles CSS

source: Combining many small images into one image, reduce downloads
es: Combinar muchas imágenes pequeñas en una imagen reduce las descargas.

source: Link prefetching
es: Precarga de enlaces

source: Ask the browser to download other pages in the background
es: Pide al navegador que descargue otras páginas en segundo plano.

source: Native client
es: Cliente nativo

source: Run native code (C/C++) in a browser sandbox
es: Ejecuta código nativo (C/C++) en la zona de pruebas de un navegador.

source: HTTP persistent connections
es: Conexiones persistentes HTTP

source: send multiple resources over the same connection
es: enviar varios recursos a través de la misma conexión

source: Web fonts
es: Fuentes web

source: natively render text instead of download images
es: Mostrar texto de forma nativa en lugar de imágenes de descarga

source: Data URI
es: URI de datos

source: Embed binary data such as images into HTML, reducing HTTP requests
es: Inserta datos binarios, como imágenes en HTML, reduciendo las solicitudes HTTP.

source: HTTP Caching
es: Almacenamiento en caché HTTP

source: Use If-Modified-Since and ETags to reduce content over the wire.
es: Utiliza If-Modified-Since y Etags para reducir el contenido que se ha de cambiar.

source: Data caching
es: Almacenamiento en caché de datos

source: Use systems like Memcache for frequently accessed data.
es: Utiliza sistemas como Memcache para datos a los que se acceda con frecuencia.

source: Local data caching
es: Almacenamiento en caché de datos locales

source: Put data on the client for faster access.
es: Incluye datos en el cliente para un acceso más rápido.

source: Content delivery networks
es: Redes de entrega de contenido

source: Place the content closer to the client with a CDN.
es: Aproxima el contenido al cliente a través de una red CDN.

source: Efficient data retrieval
es: Recuperación eficaz de datos

source: Minimize SQL calls, reduce joins, retrieve via an index.
es: Minimiza llamadas SQL, reduce uniones y recupera elementos a través de un índice.

source: Pre-calculating results
es: Precálculo de resultados

source: Denormalize or pre-calculate frequently retrieved data.
es: Desnormaliza o precalcula datos recuperados con frecuencia.

source: Minification
es: Minificación

source: Shrink your JavaScript, CSS, and even HTML files.
es: Reduce tu código JavaScript y CSS, e incluso los archivos HTML.

source: Compression
es: Compresión

source: Compress your assets via HTTP's Accept-Encoding.
es: Comprime tus elementos a través del encabezado "Accept-Encoding" de HTTP.

source: Asynchronous callbacks
es: Devoluciones de llamada asíncronas

source: Defer the work, get notified when it&rsquo;s done.
es: Pospón el trabajo y recibe una notificación cuando esté listo.

source: Hardware acceleration
es: Aceleración por hardware

source: Browsers are now using the GPU for things like canvas and transforms.
es: Los navegadores utilizan ahora la GPU para elementos como canvas y las transformaciones.

source: Moving calculations close to data
es: Aproximación de los cálculos a los datos

source: Data is bigger than algorithms, move code and not data.
es: El tamaño de los datos es superior al de los algoritmos. Debes mover el código, no los datos.

source: Profiling
es: Perfiles

source: Use tools to understand and collect real life data. Measure, don&rsquo;t guess.
es: Utiliza herramientas para interpretar y recopilar datos reales. Debes medir, no adivinar.

source: Sprites
es: Objetos móviles

source: Place many images into one file, minimizing HTTP requests.
es: Coloca muchas imágenes en un archivo reduciendo las solicitudes HTTP.

source: Image optimization
es: Optimización de imágenes

source: Compress your images, pick the right format for the job.
es: Comprime tus imágenes y escoge el formato correcto para el trabajo.

source: Specify image width and heights
es: Especificación del ancho y del alto de la imagen

source: Tell the browser how to render around images before they are downloaded.
es: Indica al navegador cómo mostrar las imágenes antes de que se descarguen.

source: Place JavaScript at the bottom of your HTML
es: Colocación del código JavaScript en la parte inferior del código HTML

source: Let the page download and begin rendering.
es: Deja que la página se descargue y empiece a mostrar imágenes.

source: Rendering on the client
es: Representación en el cliente

source: Use canvas to draw images, or web fonts to render text, instead of downloading assets.
es: Utiliza canvas para dibujar imágenes o fuentes web para representar texto en lugar de descargar elementos.

source: Read 'High Performance Web Sites' and 'Even Faster Web Sites'
es: Artículos sobre sitios web de alto rendimiento y sitios web aún más rápidos

source: Covers web app performance in great detail
es: Trata el rendimiento de las aplicaciones web en detalle.

source: Developer tools for <a href="http://www.chromium.org/devtools">Chrome</a> and <a href="http://developer.apple.com/technologies/safari/developer-tools.html">Safari</a>
es: Herramientas para desarrolladores de <a href="http://www.chromium.org/devtools">Chrome</a> y <a href="http://developer.apple.com/technologies/safari/developer-tools.html">Safari</a>

source: Peer into requests, walk the DOM, set JavaScript breakpoints, get behind the scenes
es: Analiza solicitudes, navega por el DOM, establece puntos de interrupción para JavaScript e sumérgete en el código.

source: <a href="http://www.opera.com/dragonfly/">Dragonfly</a> for Opera
es: <a href="http://www.opera.com/dragonfly/">Dragonfly</a> para Opera

source: Similar to Webkit Developer Tools, but for Opera
es: Similar a las Herramientas para desarrolladores de Webkit, pero para Opera

source: <a href="http://getfirebug.com/">Firebug</a> for Firefox
es: <a href="http://getfirebug.com/">Firebug</a> para Firefox

source: Similar to Opera Dragonfly, but for Firefox.
es: Similar a Dragonfly de Opera, pero para Firefox

source: <a href="http://www.html5rocks.com/tutorials/developertools/auditpanel/">Audit panel</a> in the Developer tools
es: El <a href="http://www.html5rocks.com/tutorials/developertools/auditpanel/">panel Audit</a> de las Herramientas para desarrolladores

source: Get suggestions for speeding up your web app
es: Obtén sugerencias para acelerar tu aplicación web.

source: <a href="http://code.google.com/webtoolkit/speedtracer/">Speedtracer</a> - not just for GWT, check out the <a href="http://www.igvita.com/2010/07/19/speed-tracer-server-side-tracing-with-rack/">Ruby plugin</a>
es: <a href="http://code.google.com/webtoolkit/speedtracer/">Speedtracer</a>: no solo para GWT, consulta el <a href="http://www.igvita.com/2010/07/19/speed-tracer-server-side-tracing-with-rack/">complemento Ruby</a>.

source: Identify and fix performance problems in your web app
es: Identifica y soluciona incidencias de rendimiento en tu aplicación web.

source: <a href="http://developer.yahoo.com/yslow/">YSlow</a> for Firebug
es: <a href="http://developer.yahoo.com/yslow/">YSlow</a> para Firebug

source: Like the Developer Tools' Audit Panel, but for Firefox
es: Como el panel Audit de las Herramientas para desarrolladores, pero para Firefox

source: <a href="http://code.google.com/closure/compiler/">Closure JavaScript compiler</a>
es: <a href="http://code.google.com/closure/compiler/">Compilador de cierre de JavaScript</a>

source: Minify, reduce, and obfuscate your JavaScript
es: Minifica, reduce y ofusca tu código JavaScript.

source: <a href="http://developer.yahoo.com/yui/compressor/">YUI Compressor</a>
es: <a href="http://developer.yahoo.com/yui/compressor/">Compresor YUI</a>

source: Minify and obfuscate your JavaScript and CSS
es: Reduce y ofusca tu código JavaScript y CSS.

source: An industry collaboration providing the testing infrastructure for testing from around the globe
es: Una colaboración de la industria que proporciona la infraestructura necesaria para realizar pruebas en todo el mundo

source: With the introduction of CSS3 it has never been easier to create rich and beautiful sites and applications in HTML. There are many new technologies and extensions to CSS3 including: <a href="http://www.w3.org/TR/css3-2d-transforms">2D Transformations</a>, <a href="http://www.w3.org/TR/css3-transistion">Transitions</a>, <a href="http://www.w3.org/TR/css3-3d-transforms">3D Transforms</a> and <a href="http://www.w3.org/TR/css3-webfonts">WebFonts</a> to name just a few.
es: Con la introducción de CSS3, nunca ha sido tan fácil crear aplicaciones y sitios tan atractivos y completos en HTML. Hay una gran cantidad de extensiones y tecnologías nuevas para CSS3, entre las que se incluyen las <a href="http://www.w3.org/TR/css3-2d-transforms">transformaciones en 2D</a>, las <a href="http://www.w3.org/TR/css3-transistion">transiciones</a>, las <a href="http://www.w3.org/TR/css3-3d-transforms">transformaciones en 3D</a> y las <a href="http://www.w3.org/TR/css3-webfonts">fuentes web</a>.

source: You can create rich user experiences with no coding effort required, just simply apply a little CSS to your existing applications.
es: Puedes crear experiencias de usuario completas ahorrándote esfuerzos de programación: solo tienes que aplicar un poco de CSS a tus aplicaciones.

source: CSS3 Transformations allow you to apply rotations, scales, skews and translations to any DOM element with simple styles.
es: Las transformaciones CSS3 te permiten aplicar rotaciones, escalas, ángulos y desplazamientos a cualquier elemento DOM con estilos sencillos.

source: Transitions allow you to specify how the style on a DOM element will animate between transformed states. For example, you can animate the background color when the user hovers over an element. <strong>Hover over this code!</strong>
es: Las transiciones te permiten especificar la forma en la que se animará el estilo de un elemento DOM entre los estados transformados. Por ejemplo, puedes animar el color de fondo cuando el usuario coloque el cursor sobre un elemento. <strong>Coloca el cursor sobre este código.</strong>

source: Applying 3D transforms is simple too. Just specify the transformation in 3d co-ordinates and you are ready. <strong>Hover over this code!</strong>
es: Aplicar transformaciones en 3D también es muy fácil: solo tienes que especificar las coordenadas de la transformación en 3D y listo. <strong>¡Coloca el cursor sobre este código!</ strong>

source: A list of the current status of the CSS3 specifications.
es: Una lista del estado actual de las especificaciones CSS3

source: This W3C specification defines the new selectors available to developers.
es: Esta especificación W3C define los nuevos selectores que están disponibles para los desarrolladores.

source: This W3C specification defines how rotations, transformations, skews and scaling should be applied to DOM elements in 2 dimensions.
es: Esta especificación W3C determina la forma en la que las rotaciones, las transformaciones, los ángulos y las escalas deben aplicarse a los elementos DOM en 2 dimensiones.

source: This W3C specification defines how 3d transformations should be applied to DOM elements.
es: Esta especificación W3C define cómo deben aplicarse las transformaciones 3D a los elementos DOM.

source: This W3C specification defines how properties should be animated between states.
es: Esta especificación W3C define cómo se deben animar las propiedades entre estados.

source: This W3C specification defines the new animation properties available.
es: Esta especificación W3C define las nuevas propiedades de animación disponibles.

source: Semantics is one of the most distinctive features of the Web Platform versus other application platforms. Developers usually ignore or de-prioritize such feature but the mastery of it can bring many benefits to our projects.
es: La semántica es una de las funciones en las que más se diferencia la plataforma web de otras plataformas de aplicaciones. Los desarrolladores suelen ignorar esta función o restarle importancia, pero su dominio puede reportar muchos beneficios para los proyectos.

source: The Web is text and text has a meaning. Ultimately the content that our browsers read is pure text. Web sites and web applications have been created in an ecosystem where text based content is linkable, searchable and mashable. In the open web scenario our content can be shown, fed and remixed by third parties, search engines and accessibility tools. All these benefits don't come for free. Automated tools can only do half of the job at recognizing the nature of the content. The better job the developer does at marking the right semantics of the content the easier will be for the rest of the agents to deal with it. HTML5 provides a series of tools to make developers life easier too:
es: La Web es texto y el texto tiene un significado. En última instancia, el contenido que leen los navegadores es puro texto. Los sitios web y las aplicaciones web se han creado en un ecosistema en el que el contenido basado en texto se puede vincular, buscar y combinar. En el ámbito de la Web de código abierto, los motores de búsqueda, las herramientas de accesibilidad y otras partes pueden mostrar, proporcionar y combinar nuestro contenido. Sin embargo, todas estas ventajas no son gratuitas: las herramientas automatizadas solo pueden realizar la mitad del trabajo al reconocer la naturaleza del contenido. Cuanto mejor sea el trabajo de etiquetado de la semántica del contenido realizado por el desarrollador, más fácil será para los demás miembros de la cadena trabajar con él. HTML5 también ofrece una serie de herramientas que facilitan el trabajo de los desarrolladores:

source: New media elements.
es: Nuevos elementos multimedia

source: New structural elements.
es: Nuevos elementos estructurales

source: New semantics for internationalization.
es: Nueva semántica de aplicación internacional

source: New link relation types.
es: Nuevos tipos de relaciones entre enlaces

source: New attributes.
es: Nuevos atributos

source: New form types.
es: Nuevos tipos de formularios

source: New microdata syntax for additional semantics.
es: Nueva sintaxis de microdatos para ampliar la semántica

source: To enable sectioning markup in old IE.
es: Posibilidad de uso del etiquetado de secciones en versiones antiguas de Internet Explorer

source: When web developers think of storing anything about the user, they immediately think of uploading to the server. HTML5 changes that, as there are now several technologies allowing the app to save data on the client device. It might also be sync'd back to the server, or it might only ever stay on the client: that's down to you, the developer.
es: Cuando los desarrolladores web quieren almacenar cualquier información del usuario, piensan inmediatamente en subir datos al servidor. Sin embargo, esto ha cambiado con HTML5, ya que actualmente existen varias tecnologías que permiten que las aplicaciones almacenen datos en los dispositivos cliente. Según lo que decida el desarrollador, la información puede sincronizarse también con el servidor o permanecer siempre en el cliente.

source: There are several reasons to use client-side storage. First, you can make your app work when the user is offline, possibly sync'ing data back once the network is connected again. Second, it's a performance booster; you can show a large corpus of data as soon as the user clicks on to your site, instead of waiting for it to download again. Third, it's an easier programming model, with no server infrastructure required. Of course, the data is more vulnerable and the user can't access it from multiple clients, so you should only use it for non-critical data, in particular cached versions of data that's also "in the cloud". See <a href="/tutorials/offline/whats-offline/">"Offline": What does it mean and why should I care?</a> for a general discussion of offline technologies, of which client-side storage is one component.
es: Hay varias razones por las que puede ser recomendable utilizar el almacenamiento en el cliente. En primer lugar, el almacenamiento en el cliente permite que una aplicación funcione cuando el usuario no está conectado, posiblemente sincronizando datos cuando vuelve a establecer conexión. En segundo lugar, aumenta el rendimiento, por lo que se puede mostrar una gran cantidad de datos en cuanto el usuario hace clic en el sitio en lugar de esperar a que vuelvan a descargarse. En tercer lugar, es un modelo de programación más sencillo que no requiere infraestructura de servidor. Por supuesto, los datos son más vulnerables y el usuario no puede acceder a ellos desde varios clientes, por lo que solo se debe utilizar para datos que no sean muy importantes, concretamente en versiones almacenadas en caché de datos específicos que también se encuentren "en la nube". Para obtener información general sobre las tecnologías sin conexión, incluida la de almacenamiento en el cliente, consulta el tutorial <a href="/tutorials/offline/whats-offline/">"Offline": What does it mean and why should I care?</a> (Sin conexión: ¿qué significa y por qué debería importarme?).

source: While Web SQL Database is supported in Chrome, Safari &amp; Opera, Firefox and IE are unlikely to support it any time soon (Mozilla is <a href="http://hacks.mozilla.org/2010/06/beyond-html5-database-apis-and-the-road-to-indexeddb/">philosophically opposed</a>). Indexed Database has an early implementation in Firefox 4.0 Beta and Chrome dev channel. There's a good chance all browsers will support it in the future, but that's not yet clear.
es: Aunque Web SQL Database se admite en Chrome, Safari y Opera, es probable que Firefox e Internet Explorer no lo admitan en el futuro (Mozilla está <a href="http://hacks.mozilla.org/2010/06/beyond-html5-database-apis-and-the-road-to-indexeddb/">filosóficamente en contra</a>). Indexed Database cuenta con una implementación anterior en Firefox 4.0 Beta y en el canal de desarrolladores de Chrome. Es muy probable que todos los navegadores lo admitan en el futuro, pero esto aún no está claro.
